package com.example.nemomind.fragmentsAll

import android.os.Bundle
import androidx.fragment.app.Fragment
import android.view.LayoutInflater
import android.view.View
import android.view.ViewGroup
import androidx.navigation.fragment.findNavController
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView
import com.example.nemomind.R
import com.example.nemomind.adaptors.AdaptorBook
import com.example.nemomind.adaptors.AdaptorTopMan
import com.example.nemomind.databinding.FragmentBookShowMoreBinding
import com.example.nemomind.databinding.FragmentTopManShowMoreBinding
import com.example.nemomind.datas.DataBook
import com.example.nemomind.datas.DataTopMan


class book_show_more : Fragment(), AdaptorBook.ItemEventsBook {



    lateinit var binding: FragmentBookShowMoreBinding


    override fun onCreateView(
        inflater: LayoutInflater,
        container: ViewGroup?,
        savedInstanceState: Bundle?
    ): View? {

        binding = FragmentBookShowMoreBinding.inflate(layoutInflater)
        return binding.root

    }

    override fun onViewCreated(view: View, savedInstanceState: Bundle?) {
        runBook()

    }

    override fun onItemClickedBook(dataBook: DataBook) {

        val book_bundel = Bundle()
        book_bundel.putParcelable("dataBook", dataBook)
        findNavController().navigate(R.id.action_book_show_more_to_book_page, book_bundel)
    }
    private fun runBook() {
        val dataBook = arrayListOf<DataBook>(

            DataBook(
                "https://s6.uupload.ir/files/کار-عمیق-رو-747x10241_6fpj.jpg",
                "کار عمیق",
                "کال نیوپورت", "" +
                        "کتاب کار عمیق یکی از تاثیرگذارترین کتاب\u200Cها در حوزه\u200Cی کسب و کار است که کال نیوپورت با هوشمندی کامل درباره\u200Cی عمیق شدن در یک کار و تفاوت آن با یک کار کم عمق صحبت می\u200Cکند.\n" +
                        "تاکنون اتفاق افتاده است که مشغول کار شوید ولی ناگهان متوجه شوید که اصلاً حواستان به کار نیست و دارید به مسائل دیگری فکر می\u200Cکنید؟ تاکنون پیش آمده که مشغول کار فکری شوید ولی نتوانید تمرکزتان را روی آن کار نگه دارید؟ کتاب کار عمیق به عنوان یکی از بهترین کتاب\u200Cها در زمینه موفقیت، کسب و کار و مدیریت تمرکز می\u200Cتواند به ما کمک کند که خیلی بهتر، مؤثرتر و سازنده\u200Cتر کار کنیم و با کار عمیق خود، نتایجی عالی به ارمغان بیاوریم.\n" +
                        "\n" +
                        "آقای نیوپورت در کتاب کار عمیق قواعدی برای کسب موفقیت در دنیای پرهرج و مرج، به ما آموزش می\u200Cدهد. وی در این کتاب می\u200Cگوید:\n" +
                        "کار عمیق، درسی است که من شخصاً در دوران کاریم بارها و بارها آن را یاد گرفتم. من ده سال است که از دنبال کنندگان سرسخت و جدی کار عمیق هستم اما هنوز هم زمان\u200Cهایی پیش می\u200Cآید که از قدرت آن غافلگیر می\u200Cشوم. در زمان دانشجویی\u200Cام که اولین بار با کار عمیق روبرو شدم و آن را اجرا کردم متوجه شدم که این کار عمیق مرا قادر کرده است تا دو مقاله معتبر و باکیفیت در سال بنویسم (این تعداد مقاله برای یک دانشجو واقعاً قابل احترام است) و در عین حال بر خلاف بسیاری از هم\u200Cدوره\u200Cهایم بیشتر از وقت اداری کار نکنم و در تعطیلات آخر هفته به ندرت به کار مشغول باشم."
            ),
            DataBook(
                "https://s6.uupload.ir/files/129074_13411_normal1_vil0.jpg",
                "باشگاه پنج صبح ها", "رابین شارما",
                "کتاب باشگاه پنج صبحی ها از آثار ارزشمند و پرفروش حوزه رشد و توسعه فردی است و تاکنون افراد زیادی آن را مطالعه کرده و از مطالب بی\u200Cنظیر آن بهره برده\u200Cاند. اساتید بهره\u200Cوری و رشد فردی بر این باور هستند که این کتاب بی\u200Cنظیر آقای رابین شارما این شایستگی را دارد که به عنوان یکی از کتاب\u200Cهای مرجع در دانشگاه\u200Cها تدریس شود.\n" +
                        "همان\u200C\u200Eگونه که از نام این کتاب انگیزشی مشخص است، مخاطب با خواندن آن با ارزش و اهمیت سحرخیزی آشنا می\u200Cشود و می\u200Cفهمد که بیدار شدن در ساعات ابتدایی صبح می\u200Cتواند قدرتی شگفت انگیز و معجزه\u200Cآسا برای او به ارمغان بیاورد.\n" +
                        "کتاب باشگاه پنج صبحی ها با یک روایت اصلی شروع می\u200Cشود که رابین شارما در حین روایت، درس\u200Cها و نکات مهم خودش را به مخاطب یادآوری می\u200Cکند. در داستان ما سه شخصیت اصلی ایفای نقش می\u200Cکنند که این سه شخصیت، یک کارآفرین افسرده و سرخورده، یک هنرمند درمانده و در جستجوی خلاقیت و یک میلیاردر بسیار موفق هستند. این سه نفر در یک سمینار بهینه\u200Cسازی فردی با یکدیگر آشنا می\u200Cشوند. در این سمینار اتفاقات جالبی رخ می\u200Cدهد و باعث می\u200Cشود که سر صحبت بین این سه نفر باز شود. این صحبت مقدمه را برای ارتباط بین این سه نفر فراهم می\u200Cکند و در نهایت میلیاردر موفق وقتی می\u200Cبیند که این دو نفر تشنه تغییر و موفقیت هستند، تصمیم می\u200Cگیرد که رمز موفقیت خودش را به آن\u200Cها بگوید.\n" +
                        "مسیری که داستان طی می\u200Cکند، بسیار جالب است. فرد موفق به هیچ عنوان رمز را کف دست آن\u200Cها نمی\u200Cگذارد. بلکه آن\u200Cها را چند روزی به جزیره خودش دعوت می\u200Cکند و به همراه آن\u200Cها سفری طولانی را در پیش می\u200Cگیرد. هر جای این سفر پر از نکته و رمز و راز است که با خواندن کتاب باشگاه 5 صبحی ها می\u200Cتوانید به این نکات ارزنده پی ببرید. یکی از جالب\u200Cترین جملاتی که در کتاب مطرح می\u200Cشود، این است که:\n" +
                        "بسیاری از افراد آرزو می\u200Cکنند که اتفاقات شگفت انگیزی برایشان رقم بخورد اما افراد موفق و برجسته یاد گرفته\u200Cاند که خوشان این اتفاقات را رقم بزنند.\n"
            ),
            DataBook(
                "https://s6.uupload.ir/files/78657_71114_normal_(1)1_acd5.jpg",
                "نیمه تاریک وجود",
                "دبی فورد",
                "برای قضاوت نشدن، پذیرفته شدن، محترم ماندن و در نهایت داشتن زندگی سالم و شاد باید درون خود را شناخت و با آن مواجه شد. بسیاری از انسان\u200Cها تلاش می\u200Cکنند تا احساسات منفی\u200Cشان را انکار و یا پنهان کنند تا در جامعه پذیرفته شوند. این احساسات همان سایه\u200Cها یا نیمه\u200Cی تاریک وجودمان هستند که همیشه برای روبرو شدن با آن\u200Cها مقاومت می\u200C\u200Cکنیم و از شناخت و تحلیل کردن\u200Cشان طفره می\u200Cرویم. کتاب نیمه\u200C تاریک وجود با ارائه\u200Cی روش\u200Cها و تمرین\u200Cهای موثر کمک می\u200Cکند تا از سایه\u200Cهای درونی خود که از چشم دیگران پنهان کرده\u200Cایم، آگاهی پیدا کنیم و برای رشد و ارتقای شخصیت خود تلاش کنیم. دبی فورد در کتاب نیمه تاریک وجود، با بیانی ساده و روان، روش\u200Cهای منظم و پیوسته\u200Cای که به یکپارچگی درونی کمک می\u200Cکنند را ارائه می\u200Cدهد. او با استفاده از تجربیات خود و دیگران شیوه\u200Cهای پذیرفتن ویژگی\u200Cهای انسانی را در ده فصل بیان می\u200Cکند."
            ),
            DataBook(
                "https://s6.uupload.ir/files/2927853316647762_0230.jpg",
                "قدرت شروع ناقص ",
                "جیمز کلیر",
                "آغاز می\u200Cکنید خودتان را با چه کسی مقایسه خواهید کرد؟ در دسترس\u200Cترین گزینه\u200Cها معمولا افراد موفق حوزه\u200Cای هستند که تصمیم داریم به آن وارد شویم، آدم\u200Cهایی که بعد از سال\u200Cها کوشش و خطا توانسته\u200Cاند راهکارهایی دقیق و تضمینی برای پیش بردن امور پیدا کنند. در این شرایط ما سعی می\u200Cکنیم به آن\u200Cها نگاه کنیم، خاطرات و تجربیاتشان را بخوانیم، پای حرف آن\u200Cها بنشینیم و قدم به قدم مسیرشان را تکرار کنیم. اما به نظر کلیر زمان شروع یک رشته یا حرفه، الگوگیری از عملکرد بهترین\u200Cهای آن حوزه کاری اشتباه است. البته یادگیری از تجربه دیگران عالی است و می\u200Cتواند به عنوان یک میانبر ما را از تجربه\u200Cهای تلخ یا روش\u200Cهای وقت\u200Cگیر نجات دهد، اما تقلید صد درصد از افراد موفق، گاهی به جای پیشروی، مانع حرکت ما می\u200Cشود. مقایسه وضعیت فعلی خود با فردی که سال\u200Cها از ما جلوتر است اغلب باعث می\u200Cشود احساس ناکافی بودن پیدا کنیم و با دیدن تجهیزات و توانایی\u200Cهای برتر دیگران، خیلی ساده دلسرد یا حتی از مسیر منحرف شویم، اما ابزار یا مهارتی که یک فرد را به بالاترین سطح کاری و حرفه\u200Cای می\u200Cرساند معمولا چیزی نیست که برای شروع از آن استفاده می\u200Cکند. جیمز کلیر در کتاب قدرت شروع ناقص سعی دارد به شما بگوید انرژی خود را در یافتن چیزی که واقعا به آن نیاز دارید صرف کنید. با پیروی از این الگو، متوجه می\u200Cشوید که جمع\u200Cآوری حریصانه و بی\u200Cمنطق ابزار، دوره\u200Cهای علمی و اطلاعات نه تنها کمک\u200Cکننده نیست، بلکه در بهترین حالت حرکتتان را کند می\u200Cکند. پس لیست طولانی نیازمندی\u200Cها را کوتاه کنید، افکار مزاحم را دور برانید و قبل از ظاهر شدن شک و تردیدهای بیشتر، اولین قدم به سمت قله را بردارید.\n"
            ),
            DataBook(
                "https://s6.uupload.ir/files/100052_64626_normal_82d8.jpg",
                "غول درون",
                "هری کارپنتر",
                "نحوه عملکرد و چگونگی استفاده از ضمیر ناخودآگاه به قلم هری کارپنتر، راهکارهایی را در اختیار شما قرار می\u200Cدهد تا به کمک آن بتوانید غول درون خود را کشف کرده و برای تغییر در روند زندگی آن را مطیع خود کنید.\n" +
                        "\n" +
                        "غول درون همان ضمیر ناخودآگاه شماست که بیشتر مواقع نمی\u200Cدانید چگونه کار می\u200Cکند و دقیقاً چطور باید از آن استفاده کرد. هدف هری کارپنتر از نگارش کتاب غول درون این است تا شما را با ضمیر ناخودآگاهتان آشنا کند. او راهنمای استفاده از ضمیر ناخودآگاه را جهت رسیدن به موفقیت، خوشبختی، سلامتی و آرامش ذهنی شما در این کتاب ارائه کرده است.\n" +
                        "\n" +
                        "اگر با چگونگی کارکرد ضمیر ناخودآگاهتان آشنایی داشته باشید گام بزرگی را در جهت رسیدن به موفقیت برداشته\u200Cاید. شیوه\u200Cها و روش\u200Cهای بکارگیری آن آسان است اما اگر از نحوه کارکرد ضمیر ناخودآگاه چیزی ندانید احتمال شکست خود را به میزان قابل توجهی افزایش خواهید داد. به عبارت دیگر می\u200Cتوان گفت کلید موفقیت آن است که به ضمیر ناخودآگاه خود از طریق یک حالت ذهنی تغییر یافته دسترسی داشته باشید.\n" +
                        "\n" +
                        "ضمیر خودآگاه انسان تنها 8٪ از ذهن را در بر می\u200Cگیرد، و مابقی متعلق به ضمیر ناخودآگاه است. ضمیر ناخودآگاه فاقد منطق بوده و تنها به ورود حسی استناد می\u200Cکند. لذا به حقایق و تصورات، به یک میزان واکنش نشان می\u200Cدهد. مثلا هنگامی که خواب پرت شدن از ساختمان را می\u200Cبینید، بدن شما واکنشی را نشان می\u200Cدهد که اگر در واقعیت این اتفاق بیفتد نشان می\u200Cدهد. بدنتان عرق کرده، ضربان قلب بالا می\u200Cرود و... پس این نکته بسیار مهم است. ضمیر ناخودآگاه تفاوت میان واقعیت و خیال را درک نمی\u200Cکند.\n" +
                        "\n" +
                        "کتاب غول درون تمرینات عملی بسیاری را نیز در اختیار شما قرار می\u200Cدهد و پس از هر درس دستورالعمل\u200Cهای ریلکسیشن ارائه می\u200Cکند که می\u200Cتوانید آن\u200Cها را دنبال کنید. جهت دستیابی به موفقیت نیاز است تا ضمیر ناخودآگاه خود را پرورش دهید و هری کارپنتر در این مسیر شما را یاری خواهد نمود.\n"
            ),
            DataBook(
                "https://s6.uupload.ir/files/frog11_6pd4.jpg",
                "قورباغه ات را قورت بده",
                "بریان تریسی",
                "کتاب قورباغه\u200Cات را قورت بده به شما نشان می\u200Cدهد چطور در حرفه\u200Cتان سریع\u200Cتر پیش بروید. این صفحات که در پیش رو دارید شامل بیست و یک اصل است که در مجموع قدرتمند\u200Cترین اصولی است که برایان تریسی (Brian Tracy) تا کنون در زمینه کارایی فردی کشف کرده است.\n" +
                        "هر ایده\u200Cای که در این کتاب عنوان می\u200Cشود روی بالا بردن سطح کلی بهره\u200Cوری، عملکرد و بازده کاری شما متمرکز شده است تا ارزش و اعتبار شما را در هر کاری که می\u200Cکنید بیشتر کند. شما می\u200Cتوانید بسیاری از این ایده\u200Cها را در زندگی خصوصی خود نیز به کار بگیرید.\n" +
                        "هر کدام از این روش\u200Cها و تکنیک\u200Cهای بیست و یک گانه به خودی خود کامل بوده و همگی ضروری هستند. روی هم رفته این ایده\u200Cهای بیست و یک گانه درمورد کارایی فردی مثل غذاهای متنوعی هستند که می\u200Cتوان آن\u200Cها را در هر زمان و به ترتیب اهمیتی که در شرایط کنونی برای شما دارد به طور دلخواه مورد استفاده قرار داد.\n" +
                        "کلید موفقیت عمل کردن است. این اصول برای بوجود آوردن سرعت و قابلیت پیش\u200Cبینی در عملکرد\u200Cها و نتایج به کار پرفته می\u200Cشوند. هرچقدر سریع\u200Cتر آن\u200Cها را یاد بگیرید و به کار ببندید مطمئنا در حرفه خود سریع\u200Cتر پیشرفت خواهید کرد."
            )

        )
        val adapterBook = AdaptorBook(dataBook, this)
        binding.recyclerShowMoreBook.adapter = adapterBook
        binding.recyclerShowMoreBook.layoutManager =
            LinearLayoutManager(context, RecyclerView.VERTICAL, false)
    }



}