package com.example.nemomind.fragmentsAll

import android.os.Bundle
import androidx.fragment.app.Fragment
import android.view.LayoutInflater
import android.view.View
import android.view.ViewGroup
import androidx.navigation.fragment.findNavController
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView
import com.example.nemomind.R
import com.example.nemomind.adaptors.AdaptorEducation
import com.example.nemomind.databinding.FragmentEducationShowMoreBinding
import com.example.nemomind.datas.DataEducation

class education_show_more : Fragment(), AdaptorEducation.ItemEventsEducation {
    lateinit var binding: FragmentEducationShowMoreBinding


    override fun onCreateView(
        inflater: LayoutInflater,
        container: ViewGroup?,
        savedInstanceState: Bundle?
    ): View? {

        binding = FragmentEducationShowMoreBinding.inflate(layoutInflater)
        return binding.root

    }

    override fun onViewCreated(view: View, savedInstanceState: Bundle?) {
        runEducation()

    }

    private fun runEducation() {
        val dataEducation = arrayListOf<DataEducation>(
            DataEducation(
                "https://s6.uupload.ir/files/8899732-removebg-preview_oel.png",
                "سیستم مطالعاتی بدون فراموشی",
                "مطالعه کن بدون اینکه چیزی رو فراموش کنی!",
                "سلام دوست عزیز✋\uD83C\uDFFB\n" +
                        "توی این بخش میخوام یه سیستم مطالعاتی عالی بهت بگم تا دیگه مطالب کتاب هایی که می خونی رو فراموش نکنی .\uD83D\uDE04\uD83D\uDC4D\uD83C\uDFFB\n" +
                        "این سیستم 7 مرحله داره:\n" +
                        "1.بررسی اجمالی : در مرحله اول بین 5 تا 15 دقیقه سعی کن اطلاعاتی مثل نام نویسنده ، سال نشر ، تعداد چاپ ، فهرست ، سرفصل ها ، نمودار ها ، خلاصه های کتاب ، عکس ها ، نتیجه گیری ها و... رو از کتاب به دست بیاری و اصلا نیاز نیست کتاب رو ریز به ریز بخونی چون هدف اینجا یادگیری نیست❌. برای این قسمت میتونی از تکنینک اسکن و اسکیم استفاده کنی .\n" +
                        "تکنینک اسکن: خواندن پاراگراف های اول و اخر و حرکت بسیار سریع چشم بر روی بقیه مطالب\uD83D\uDE0E\uD83E\uDD1D\n" +
                        "تکنینک اسکیم: کشیدن انگشت به صورت عمودی از بالا تا پایین روی کتاب و حرکت دادن چشم با حرکت دست \n" +
                        "\n" +
                        "2. سوال گذاری: در مرحله بعدی با استفاده از فهرست کتاب ، موضوع کتاب ، سر تیترها و عناوین ، هدف خود یا نویسنده ، برای خودت سوال ایجاد کن . میدونی دلیلش چیه؟\n" +
                        " طبق اثر زایگارنیک زمانی که در ذهن انسان سوال ایجاد بشه ، مطالب خیلی بهتر در ذهن باقی می مونن.\uD83D\uDE09✨\n" +
                        "3.خواندن: در این مرحله علاوه بر خواندن باید یادداشت برداری هم انجام بدی. مواظب باش که اصلا به عقب برنگردی و هرجا رو متوجه نشدی فقط یه علامت بزن . توجه داشته باش که فقط 20 الی 30 درصد زمان صرف خواندن میشه و 70الی 80 درصد، صرف یادداشت برداری میشه.\n" +
                        "یادداشت برداری 2 مرحله  داره :️\uD83C\uDFFB\uD83D\uDE04\n" +
                        "مرحله اول: یادداشت برداری خام که یعنی جدا کردن مطالب مهم از غیر مهم  و بدون نظم خاصی .\n" +
                        "مرحله دوم: ترسیم نقشه ذهنی و قرار دادن کلمات کلیدی در اون\n" +
                        "\n" +
                        "4.بازنگری : در این مرحله  فرصت داری تا هر جا رو که علامت زدی و متوجه نشدی ، دوباره مطالعه کنی.✅\n" +
                        "\n" +
                        "5.الگو یادآوری: در واقع این بخش به نقشه ذهنی اشاره داره. در نقشه ذهنی موضوع اصلی در وسط و جزئیات مهم بر روی خط های هایی که از موضوع اصلی سرچشمه میگرن، نوشته میشه و سپس نکات فرعی، روی خط هایی که از جزئیات مهم سرچشمه میگرن نوشته میشه. بهتره هر بخشی  یک رنگ خاص داشته باشه تا بهتر در ذهن نقش ببنده.\uD83D\uDE0C\n" +
                        "\n" +
                        "6. تفکر و امتحان: در این قسمت، باید از حالت منفعل به فعال تبدیل بشی یعنی مثلا از مطالبی که خوندی از خودت امتحان بگیر و یا برای یک نفر توضیح بده.\n" +
                        "\n" +
                        "7. مرور : در مرحله آخر با استفاده از نقشه ذهنی و خلاصه هات مطالبی که خوندی رو مرور کن.\uD83E\uDD1D✨\n",
                "https://uploadkon.ir/uploads/673c05_24سیستم-مطالعاتی-۲۰۲۳-۰۵-۱۸-۱۸-۱۸-۲۷-۳۳۳.mp3"
            ),

            DataEducation(
                "https://s6.uupload.ir/files/5100731-removebg-1_ye3j.png",
                "تکنیک سوپر مرور",
                "جوری مرور کن که دیگه هیچ وقت مطالب یادت نرن!",
                "سلام رفیق✋\uD83C\uDFFB\n" +
                        "در این آموزش میخوام تکنیک سوپر مرور رو بهت بگم که دیگه مطالب فراموشت نشن.\uD83D\uDE0E\uD83E\uDD1D \n" +
                        "طبق نمودار فراموشی ابینگ هاوس وقتی5 بار مرور کنی دیگه اطلاعات توی ذهنت ثبت میشن . \n" +
                        "حالا اگر میخوای مرور کنی بهت این تکنینک رو که بازه زمانیش یک هفته هست پیشنهاد میکنم.\uD83D\uDE0E\uD83D\uDC4D\uD83C\uDFFB\n" +
                        "\n" +
                        "روز اول (شنبه): خواندن مطلب جدید(A)\n" +
                        "\n" +
                        "روز دوم (یکشنبه): ابتدا مرور مطلب روز شنبه(A) ، سپس خواندن مطلب جدید(B)\n" +
                        "\n" +
                        "روز سوم (دوشنبه): ابتدا مرور مطلب روز شنبه و یکشنبه(A و B)  ، سپس خواندن مطلب جدید(C)\n" +
                        "\n" +
                        "روز چهارم (سه شنبه): ابتدا مرور مطلب روز شنبه و یکشنبه و دوشنبه (A  و B و C) ، سپس خواندن مطلب جدید(ِD) و مرور مطلب روز یکشنبه و دوشنبه و سه شنبه ( B و C و D) در آخرشب\n" +
                        "\n" +
                        "روز پنجم(چهارشنبه): ابتدا مرور مطلب روز دوشنبه و سه شنبه (C  وِD) ، سپس خواندن مطلب جدید(E) و مرور مطلب روز سه شنبه و چهارشنبه (D و E) در آخرشب\n" +
                        "\n" +
                        "روز ششم (پنجشنبه): ابتدا مرور مطلب روز چهارشنبه (ٍE) ، سپس خواندن مطلب جدید(F) و مرور مطلب روز چهارشنبه و پنجشنبه (E و F) در آخرشب\n" +
                        "\n" +
                        "روز هفتم (جمعه): ابتدا مرور مطلب روز پنجشنبه(E) ، سپس مرور مطالب روز شنبه ، یکشنبه، دوشنبه، سه شنبه و چهارشنبه ( A و B  و C  و D و E و F)  و مرور مطالب  کل هفته در آخرشب\n" +
                        "\n" +
                        "و در آخر لازمه که به یک نکته توجه کنی✅. \n" +
                        "در اینجا شاید با خودت فکر کنی که این مرور ها زمان زیادی ازت می گیره در حالی که مرور هر قسمت باید کمتر از 5 دقیقه باشه ؛ پس نیاز نیست وسواس به خرج بدی. .\uD83D\uDE01✋\uD83C\uDFFB\n" +
                        "راستی برای مرور میتونی از خلاصه هات استفاده کنی تا وقت کمتری ازت بگیره.\uD83D\uDC4D\uD83C\uDFFB",
                "https://uploadkon.ir/uploads/7c7405_24سوپر-مرور-اصلی-۲۰۲۳-۰۵-۱۸-۰۱-۲۳-۱۶-۷۹۰.mp3"
            ),
            DataEducation(
                "https://s6.uupload.ir/files/7561084-removebg-preview_0aj.png",
                "تکنیک های حافظه",
                "کلی چیز رو به خاطرت بسپار بدون اینکه فراموششون کنی!",
                "سلام رفیق✋\uD83C\uDFFB\n" +
                        "توی این بخش میخوام بهت 3 تا تکنیک حافظه فوق العاده بگم تا بتونی به راحتی کلمات رو حفظ کنی\uD83D\uDE0E\n" +
                        "تکنیک زنجیر: برای استفاده از این تکنیک باید تصویر سازی کنی . مثلا اگر میخواهی 4 تا کلمه حفظ کنی باید برای کلمه اول و دوم ، دوم و سوم ، سوم و چهارم یک تصویر مجزا بسازی . تصویر هایی که می سازی حتما باید مسخره، خنده دار و اغراق آمیز باشن \uD83D\uDE43سعی کن خودت هم توی اون تصویر باشی و با جزئیات اون رو توی ذهنت ثبت کنی. \n" +
                        "یک مثال برات میزنم تو خوب برات جا بیوفته. مثلا میخوای 3 کلمه قایق، موز وگنجشک  رو حفظ کنی. اول برای قایق و موز یه تصویر می سازی. برای مثال:«یک قایق بود که بدنش از موز درست شده بود و ماهیا سعی داشتن از اون موزا بخورن ».حالا برای موز و گنجشک یک تصویر می سازی. برای مثال :«یه گنجشکی بود که وقتی نزدیکش می شدی از بوی موز مدهوش می شدی تازه سرش هم شیبه ته موز بود». \n" +
                        "برای تصویر سازی باید به چند نکته دقت کنی: \n" +
                        "1. از قوه تخیلت استفاده کن  و تصویر های عجیب و غریب و مسخره بساز حتی اگر آدم جدی ای هستی.\n" +
                        "2. اولین تصویری که به ذهنت اومد رو شکار کن.\n" +
                        "3.شاید اولش براتون وقت گیر باشه ولی به تدریج و با تمرین کردن میتونید خیلی سریع کلمات رو به خاطر بسپارید .\n" +
                        "4. حافظه هم مثل سایر اندام برای قوی شدن نیاز به تمرین و ورزش داره ؛ پس صبور باش\uD83E\uDD1D✨\n" +
                        "حالا که این تکنینک رو یادگرفتی 15کلمه رو بنویس و سعی کن توی 2 دقیقه اونها رو به خاطر بسپاری . \n" +
                        "اگر تونستی که خیلی عالیه . برای تمرین بعدی تعداد کلمات رو بیشتر کن.\n" +
                        "اگر هم نتونستی فدای سرت . تمرین کن تا بتونی\uD83D\uDC4C\uD83C\uDFFB\uD83D\uDE04\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "تکنینک کدینگ : دراین تکنینک اول  باید برای هر عدد یک کد بزاری این کد ها تصویر اجسامی هستند که به اون عدد شبیه هستن. مثلا کد های عدد 0 تا10 رو میتونی به این صورت انتخاب کنی\uD83D\uDC47\uD83C\uDFFB\uD83D\uDE01:\n" +
                        "عدد 0 =توپ(گرده. شبیه عدد 0 هست)⚽\n" +
                        "عدد1=عصا (بلند و درازه . شبیه عدد1)\uD83E\uDE84\n" +
                        "عدد2=ترازو(2کفه داره)⚖\n" +
                        "عدد3=چراغ راهنمایی(3رنگ داره)\uD83D\uDEA6\n" +
                        "عدد4=چهار راه(4 تا راه داره)\uD83D\uDEE3\n" +
                        "عدد5=ستاره(5گوشه داره)⭐\n" +
                        "عدد6=تاس(6وجه داره)\uD83C\uDFB2\n" +
                        "عدد7=هفت تیر (از اسمش مشخصه)\uD83D\uDD2B\n" +
                        "عدد8=کوه(شکلش شبیه عدد 8)⛰\n" +
                        "عدد9=سوت (سوت شبیه عدد 9)\n" +
                        "عدد10=کامیون 10 (10 تا چرخ داره)\uD83D\uDE9B\n" +
                        "اینها صرفا مثال هستن . تو میتونی اجسام دیگه ای رو انتخاب کنی. \n" +
                        "توی مرحله بعد اگر مثلا بخوای  3 تا کلمه مثل  فرش ، میز و دوچرخه  رو حفظ کنی، برای کلمه اول باید با عصا که کد شماره 1 هست و فرش یه تصویر بسازی . برای کلمه دوم باید با ترازو که کد شماره 2 هست و میز یک تصویر بسازی و در آخر برای کلمه سوم با چراغ راهنمایی که کد عدد 3 هست  و دوچرخه یک تصویر دیگه بسازی. \n" +
                        "دقت داشته باش که تصاویرت مشخصاتی که توی تکنیک قبلی گفتم رو داشته باشن.\uD83D\uDE09\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        " تکنینک اتاق رومی: یک مکان مثل خونه رو در تصور کن  و تمام قسمت های اون رو به ترتیب حفظ کن حالا به ترتیب با هر کلمه و یک قسمت از اون مکان تصویر بساز. کلمه اول با اولین قسمت خانه ، دومین کلمه با قسمت دوم خانه و... \n" +
                        "برای مثال وقتی وارد خونه میشی اول یه در داره بعد حیاط و بعد باغچه و... حالا اگر بخوای 3 کلمه مثل  مورچه – موشک – روزنامه رو حفظ کنی با در و مورچه ، موشک و حیاط  ، روزنامه و مورچه تصویرسازی کنی .\n" +
                        "بازهم استفاده از نکات تصویر سازی در تکنیک اول یادت نره.\uD83D\uDE09\n" +
                        "\n" +
                        "شاید برات سوال باشه که چرا همش باید تصویر بسازیم\uD83D\uDE01\n" +
                        "اقای کوین ترودا میگه :\n" +
                        "تصاویر پایه های فکری ما هستند ؛ یعنی تصاویر افکار ما رو می سازند . هر وقت تصویر نباشد تفکر هم صورت نمی گیرد.\n" +
                        "\n" +
                        "\n" +
                        "در آخر لازم دونستم چند تا نکته رو یادآور بشم :\uD83D\uDC4C☺️\n" +
                        "1.شاید اولین بار که انجام بدی به نظر وقت گیر بیاد ولی وقتی تمرین کنی متوجه میشی که چقد راحت و در مدت زمان کم میتونی کلمات رو به خاطر بسپاری.\n" +
                        "2.تعداد کلماتی که برای مثال گفتم صرفا برای مثال بود .تو می تونی کلمات خیلی بیشتری رو حفظ کنی.\n" +
                        "3.حتما تصاویرت مشخصاتی مانند اغراق ، خنده دار بودن و عجیب و غریب بودن رو داشته باشن.",
                "https://uploadkon.ir/uploads/1ede05_24تقویت-حافطه-۲۰۲۳-۰۵-۱۸-۰۱-۱۱-۳۷-۸۸۵.mp3"
            ),
            DataEducation(
                "https://s6.uupload.ir/files/4904579-removebg-preview1_aln4.png",
                "تکنیک های تمرکز",
                "به سادگی تمرکزت رو به حداکثر برسون!",
                "سلام دوست عزیز✋\n" +
                        "در این بخش می خوام چند تا تکنیک تمرکزبهت بگم تا دیگه بتونی با خیال راحت و تمرکز هر چه تمام تر مطالعه کنی و به کارهات برسی. هرکدوم رو دوست داشتی میتونی استفاده کنی و لذت ببری. \n" +
                        "\n" +
                        "اول از همه بزار بهت بگم چه مواقعی تمرکز کم میشه:\n" +
                        "1.عجله \n" +
                        "2.شرایط دشوار\n" +
                        "3.استرس و اضطراب \n" +
                        "4.احساست بسیار قوی\n" +
                        "5.موازی کاری (در عین حال چند کار انجام دادن)\n" +
                        "6.خستگی \n" +
                        "7.عدم اعتماد به نفس\n" +
                        "\n" +
                        "\n" +
                        "1.تکنینک صندلی تمرکز : یه صندلی در نظر بگیر و مطالعه یا هر کاری که مد نظرت هست رو فقط روی اون صندلی انجام بده و از وقتی که میشنی تا وقتی که بلند میشی رو زمان بگیر . اگر هم هر کاری غیر از کار مدنظرت خواستی انجام بدی از روی صندلی بلند شو و زمانت رو متوقف کن. حالا آخر شب ببین این همون مدت زمانیه که میخواستی به کارت بپیردازی یانه. مطمئن باش دیگه از اون به بعد کارهای غیر مهمت رو حذف می کنی.\n" +
                        "\n" +
                        "2.تکنیک کشوی ذهنی: قراره با این تکنیک پرونده های باز ذهنت رو ببندی. برای این کار یه برگه بردار و تمام چیزاهایی که ذهنت رو مشغول کرده رو توی برگه هایی جداگانه با جزئیات بنویس. راستی ، دقت کن که فقط 3 دقیقه زمان داری. حالا اگر نتونستی توی 3 دقیقه این کارو انجام بدی یه وقت اضافه 2 دقیقه ای به خودت بده. مطمئن باش نتیجه میگیری.\n" +
                        "\n" +
                        "3.تکنینک حواسپرتی اختیاری: 6تا جسم رو انتخاب کن و به تمام جزئیاتشون فکر کن . برای هر جسم 10 ثانیه فرصت داری .\n" +
                        "\n" +
                        "4.تمرین شمارش معکوس : برای این تمرین باید یک عدد رو در نظر بگیری و به هر اندازه ای که دوست داری ازش کم کنی. مثلا از عدد 300 ، 3تا3تا کم کن تا به عدد1 برسی.\n" +
                        "\n" +
                        "5.تمرین آدم برفی: در 2 دقیقه یک آدم برفی رو تصور کن و توی ذهنت اون رو آب کن. راستی یه نکته ، هرچقدر دیرتر آدم برفی رو آب کنی بهتره\n" +
                        "\n" +
                        "6.تکنیک گوش کردن : اول از همه چشمان خودت رو ببند و در جایی بشین. تمرکزت رو روی هوای ورود و خروج از بینیت قرار بده، سپس بدون هیچ گونه قضاوتی به صداهای اطرافت گوش کن، طوری که انگار فقط گوش تو دریافت کننده این صداهاست.\n" +
                        "\n" +
                        "7.تمرین ساعت و تلویزیون: به مدت 5 ثانیه  جلوی تلویزون روشن، روی عقربه ثانیه شمار ساعت تمرکز کن و به مرور زمان رو بیستر کن \n" +
                        "\n" +
                        "حالا میخوام توی این بخش یه چند تا نکته کوچیک بهت بگم که تمرکزت رو بالا ببری:\n" +
                        "1.کارهات رو به تعویق ننداز\n" +
                        "2.استفاده از راهنمای تصوری \n" +
                        "3.منظم باش\n" +
                        "4.کسب آرامش\n" +
                        "5.به بهانه انگیزه نداشتن منتظر نمون(یادت باشه انگیزه از اقدام به وجود میاد)\n" +
                        "6.کارهات رو به بخش های کوچکتر تقسیم کن\n" +
                        "7.وقتی با کارهات رو به رو شدی به مزایاش فکر کن نه مشکلات \n" +
                        "8.قبل از انجام کاری ، اول اون رو تمرین کن\n" +
                        "8.هرگز خودت رو به خاطر هوش پایین سرزنش نکن\n" +
                        "10.استراحت یادت نره",

                "https://uploadkon.ir/uploads/1cc305_24تکنینک-تمرکز-۲۰۲۳-۰۵-۱۸-۱۸-۴۲-۰۶-۲۱۱.mp3"
            ),
            DataEducation(
                "https://s6.uupload.ir/files/4584-removebg-preview_xxed.png",
                "برنامه ریزی به روش آی وی لی ",
                "به بهترین شکل کاراتو برنامه ریزی کن!",
                "سلام دوست من✋\n" +
                        "در این قسمت میخوام یک روش برنامه ریزی برای به حداکثر رساندن بهره وری بهت آموزش بدم این روش رو آقای آی وی لی ارائه دادن.\uD83D\uDE0E✨\n" +
                        "\n" +
                        "1.در پایان هر روز 6 فعالیت مهم فردا را یادداشت کن و  بر اساس اولویت بنویس.\n" +
                        "2. با اومدن  فردا بر اولین اولویت تمرکز کن و تا تمام نشده سراغ بعدی نرو. \n" +
                        "3.همین روال برای بقیه کارها پیش ببر ، هر کار ناتمام ماند به لیست فردا انتقال  بده.\n" +
                        "4. این فعالیت را در هر روز کاری تکرار کن.\n" +
                        "\n" +
                        "\n" +
                        "راستی  چندتا نکته هست که بهتره بهشون توجه کنی:\uD83D\uDC4C\uD83D\uDE0A\n" +
                        "1.مهمترین کارهات رو در ابتدای روز انجام بده. چون: \n" +
                        "\uD83D\uDD35عزم و اراده در ابتدای روز بیشتره. \n" +
                        "\uD83D\uDD35هر چه روز جلوتر می ره ، احتمال به هم ریختن برنامه یا فعالیت های ثانویه بیشتر می شه.\n" +
                        "\uD83D\uDD35ذهن انسان از پروژه های نیمه تمام بیزاره.\n" +
                        "2.هیچ گاه قبل از ظهر گوشیت رو چک نکن و به فضای مجازی نرو.\n" +
                        "3.به جای کارایی، بر اثر بخشی تمرکز کن.\n" +
                        "4سلام دوست من✋\n" +
                        "در این قسمت میخوام یک روش برنامه ریزی برای به حداکثر رساندن بهره وری بهت آموزش بدم این روش رو آقای آی وی لی ارائه دادن.\uD83D\uDE0E✨\n" +
                        "\n" +
                        "1.در پایان هر روز 6 فعالیت مهم فردا را یادداشت کن و  بر اساس اولویت بنویس.\n" +
                        "2. با اومدن  فردا بر اولین اولویت تمرکز کن و تا تمام نشده سراغ بعدی نرو. \n" +
                        "3.همین روال برای بقیه کارها پیش ببر ، هر کار ناتمام ماند به لیست فردا انتقال  بده.\n" +
                        "4. این فعالیت را در هر روز کاری تکرار کن.\n" +
                        "\n" +
                        "\n" +
                        "راستی  چندتا نکته هست که بهتره بهشون توجه کنی:\uD83D\uDC4C\uD83D\uDE0A\n" +
                        "1.مهمترین کارهات رو در ابتدای روز انجام بده. چون: \n" +
                        "\uD83D\uDD35عزم و اراده در ابتدای روز بیشتره. \n" +
                        "\uD83D\uDD35هر چه روز جلوتر می ره ، احتمال به هم ریختن برنامه یا فعالیت های ثانویه بیشتر می شه.\n" +
                        "\uD83D\uDD35ذهن انسان از پروژه های نیمه تمام بیزاره.\n" +
                        "2.هیچ گاه قبل از ظهر گوشیت رو چک نکن و به فضای مجازی نرو.\n" +
                        "3.به جای کارایی، بر اثر بخشی تمرکز کن.\n" +
                        "4.با جعبه آیزنهاور بهره وری خودت رو افزایش و فعالیت های هدر دهنده ی زمان را کاهش بده..با جعبه آیزنهاور بهره وری خودت رو افزایش و فعالیت های هدر دهنده ی زمان را کاهش بده. ",
                "https://uploadkon.ir/uploads/d37805_24برنامه-ریزی-اصلی-۲۰۲۳-۰۵-۱۸-۰۰-۳۷-۴۹-۵۸۹.mp3"
            ),
            DataEducation(
                "https://uploadkon.ir/uploads/591005_245385957-removebg-preview.png",
                "مدیریت زمان",
                "زمانت رو به بهترین شکل مدیریت کن", "سلام دوست عزیز من✋\n" +
                        "توی این بخش میخوام نکاتی رو درباره مدیریت زمان بهت بگم.\n" +
                        "\n" +
                        "اول از همه می خوام بهت بگم چه افرادی دچار کمبود زمان میشن:\n" +
                        "1-  کسانی که هیچ کاری را شروع نکنند و مدام اهداف بزرگتری داشته باشند.\n" +
                        "2- افرادی که اولویت بندی کارها رو ندارن.\n" +
                        "3- کسانی که کارها رو واگذار نکنن.\n" +
                        "4- کسانی که وسواس دارن و کمال گرا هستن.\n" +
                        "5- کسانی که تنبل و اهمال کار هستن.\n" +
                        "6- کسانی که توان نه گفتن رو ندارن.\n" +
                        "7-کسانی که مدیریت انرژی رو نمی دونن.\n" +
                        "\n" +
                        "حالا میخوام تو رو با یک قانون مدیریت زمان به اسم «قانون گروگان گیری» آشنا کنم.\n" +
                        "اول یکم عمیق تر به برنامه ریزی زندگیت و این قانون نگاه کن، قانون گروگان گیری زمان میگه:تو خیلی راجب زمانت دست و دل باز فکر می کنی. مثلا صبح که بیدار می شی میگی:« من کلی وقت دارم، حالا کو تا شب!!» یک عالمه کار های متفرقه و بی خود انجام می دی و کار اصلی رو می زاری کنار، به خیال اینکه بعدا دونه دونه بهشون می رسی؛ اما در حقیقت تو در دست یک سری عادت های روزمره و دست و پاگیر اسیری شدی .40 درصد زندگی تو، دست عادت هاته وبه خاطر این عادت های بی خود اسیر شدی . \n" +
                        "داخل ذهنت یک زندانی رو تصور کن که بهش دو ساعت وقت دادن  تا به هر کاری که داره برسه و برگرده. به نظرت اون چطور از این دو ساعت به نحو احسنت استفاده میکنه؟! حالا این قانون میگه تصور کن که تو رو برای دو ساعت آزاد گذاشتن و بهت فرصت دادن تا به کارهای مهم زندگیت برسی ولی دوباره گروگان می گیرنت و زندانیت می کنن . تصور کن مثل یک زندانی باید تلاش کنی تا مهم ترین و بهترین کارهات رو اولیت قرار بدی.\n" +
                        " حتما این روش رو استفاده کن تا ببینی چقدر بهره وریت از زمان افزایش پیدا میکنه و در یک ماه به چندین ساعت می رسه!!. ببین چقدر کارهای مفیدی انجام دادی و سعی کن کارهایی که انجام میدی متمرکز باشه و پراکنده نباشه.\n" +
                        "\n" +
                        "راستی، یه نکته، پیدا کردن سارقین زمان، یک موضوع مهم در مدیریت زمانه پس برای این موضوع باید یه کاری انجام بدی. حالا به نظرت اون کارچیه؟\uD83E\uDD14\uD83D\uDE43\n" +
                        "تو باید در این تکنیک کارآگاه بازی در بیاروری و یک هفته به صورت دقیق خودت رو زیر نظر بگیری و در یک جدول که تمام روزهای هفته و از ساعت 7 تا11 نوشته شده،یادداشت کنی . توجه داشته باش که هر ساعت هر کاری که انجام دادی باید بنویسی. مثلا شنبه ساعت 9تا10 درس خوندی، 10تا11 باموبایل کار کردی و...\n" +
                        "حالا بعد یک هفته به جدولت نگاه کن.کدوم کار بیشترین زمان رو از تو گرفته؟ایا برنامه روزانت مناسبه؟چه زمان هایی می تونی بهتر به کارهات برسی؟ایا تفریحت به اندازه بوده؟ مطالعت چطور؟ و خیلی چیزهای دیگه که میتونی با استفاده از این جدول متوجه بشی.\n" +
                        "\n" +
                        ".5 :نکته طلایی برای استفاده\u200Cی بهتر از زمان\n" +
                        "1- مواردی را که دقتت را می\u200Cگیره رو مشخص کن و در کنار اون یک مقوای کوچک به عنوان ناظم قرار بده.\n" +
                        "2-  زمان استفاده از تلویزیون و فضای مجازی را محدود کن.\n" +
                        "3- از افراد دارای استرس که بهت سیگنال منفی میدن دوری کن.\n" +
                        "4- سعی کنید ساعت بیولوژیک بدنت رو تنظیم کن که در ساعت خاصی بخوابی و بیدار بشی.\n" +
                        "5- با کنجکاوی و سوال پرسیدن، دقت و تمرکز حواس و قوه تخیل (خلاقیت) رو زیاد کن.\n" +
                        "\n" +
                        "3 راه برای غلبه بر قانون پارکینسون:\n" +
                        "✓ وظایف و کارهای مختلف را بخش بخش کن.\n" +
                        "✓ جایزه ای برای خودت تعیین کن.\n" +
                        "✓ گام بعدی رو ترسیم کن.\n",
                "https://uploadkon.ir/uploads/b8ad05_24مدیریت-زمان-۲۰۲۳-۰۵-۱۸-۰۱-۱۹-۰۰-۰۵۷.mp3"
            )


        )
        val AdapterEducation = AdaptorEducation(dataEducation, this)
        binding.recyclerShowMoreEducation.adapter = AdapterEducation
        binding.recyclerShowMoreEducation.layoutManager =
            LinearLayoutManager(context, RecyclerView.VERTICAL, false)
    }

    override fun onItemClickedEducation(dataEducation: DataEducation) {

        val education_bundel = Bundle()
        education_bundel.putParcelable("dataEducation", dataEducation)
        findNavController().navigate(R.id.action_education_show_more_to_educationPage, education_bundel)


    }


}