package com.example.nemomind.fragmentsAll

import android.annotation.SuppressLint
import android.app.DirectAction
import android.content.Intent
import android.os.Bundle
import androidx.fragment.app.Fragment
import android.view.LayoutInflater
import android.view.View
import android.view.ViewGroup
import android.widget.Toast
import androidx.navigation.fragment.NavHostFragment
import androidx.navigation.fragment.findNavController
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView
import com.bumptech.glide.manager.SupportRequestManagerFragment
import com.denzcoskun.imageslider.constants.ScaleTypes
import com.denzcoskun.imageslider.models.SlideModel
import com.example.nemomind.R
import com.example.nemomind.adaptors.AdaptorBook
import com.example.nemomind.adaptors.AdaptorEducation
import com.example.nemomind.adaptors.AdaptorMusic
import com.example.nemomind.adaptors.AdaptorTopMan
import com.example.nemomind.databinding.FragmentEducationPageBinding
import com.example.nemomind.databinding.FragmentHomeMainBinding
import com.example.nemomind.datas.DataBook
import com.example.nemomind.datas.DataEducation
import com.example.nemomind.datas.DataMusic
import com.example.nemomind.datas.DataTopMan
import java.sql.DatabaseMetaData
import javax.xml.datatype.DatatypeConfigurationException


class home_main: Fragment(), AdaptorEducation.ItemEventsEducation, AdaptorTopMan.ItemEventsTopMan,
    AdaptorBook.ItemEventsBook, AdaptorMusic.ItemEventsMusic {
    lateinit var binding: FragmentHomeMainBinding
    override fun onCreateView(
        inflater: LayoutInflater,
        container: ViewGroup?,
        savedInstanceState: Bundle?
    ): View? {
        binding = FragmentHomeMainBinding.inflate(layoutInflater)
        return binding.root
    }

    @SuppressLint("ResourceType")
    override fun onViewCreated(view: View, savedInstanceState: Bundle?) {


        //image slider
        imageSlider()
        runEducation()
        runTopMan()
        runBook()
        runMusic()


        binding.btnOptionNote.setOnClickListener {
            findNavController().navigate(R.id.action_home_main_to_note)

        }
        binding.btnOptionManageMoney.setOnClickListener {
            findNavController().navigate(R.id.action_home_main_to_manage_money)
        }
        binding.btnOptionCalender.setOnClickListener {
            findNavController().navigate(R.id.action_home_main_to_calender)
        }


        binding.seeMoreEducationHome.setOnClickListener {
            findNavController().navigate(R.id.action_home_main_to_education_show_more)
        }
        binding.seeMoreMusicHome.setOnClickListener {
            findNavController().navigate(R.id.action_home_main_to_music_show_more) }
        binding.seeMoreBookHome.setOnClickListener {
            findNavController().navigate(R.id.action_home_main_to_book_show_more) }
        binding.seeMoreTopManHome.setOnClickListener {
            findNavController().navigate(R.id.action_home_main_to_top_man_show_more) }


    }


    private fun runEducation() {
        val dataEducation = arrayListOf<DataEducation>(
            DataEducation(
                "https://s6.uupload.ir/files/8899732-removebg-preview_oel.png",
                "سیستم مطالعاتی بدون فراموشی",
                "مطالعه کن بدون اینکه چیزی رو فراموش کنی!",
                "سلام دوست عزیز✋\uD83C\uDFFB\n" +
                        "توی این بخش میخوام یه سیستم مطالعاتی عالی بهت بگم تا دیگه مطالب کتاب هایی که می خونی رو فراموش نکنی .\uD83D\uDE04\uD83D\uDC4D\uD83C\uDFFB\n" +
                        "این سیستم 7 مرحله داره:\n" +
                        "1.بررسی اجمالی : در مرحله اول بین 5 تا 15 دقیقه سعی کن اطلاعاتی مثل نام نویسنده ، سال نشر ، تعداد چاپ ، فهرست ، سرفصل ها ، نمودار ها ، خلاصه های کتاب ، عکس ها ، نتیجه گیری ها و... رو از کتاب به دست بیاری و اصلا نیاز نیست کتاب رو ریز به ریز بخونی چون هدف اینجا یادگیری نیست❌. برای این قسمت میتونی از تکنینک اسکن و اسکیم استفاده کنی .\n" +
                        "تکنینک اسکن: خواندن پاراگراف های اول و اخر و حرکت بسیار سریع چشم بر روی بقیه مطالب\uD83D\uDE0E\uD83E\uDD1D\n" +
                        "تکنینک اسکیم: کشیدن انگشت به صورت عمودی از بالا تا پایین روی کتاب و حرکت دادن چشم با حرکت دست \n" +
                        "\n" +
                        "2. سوال گذاری: در مرحله بعدی با استفاده از فهرست کتاب ، موضوع کتاب ، سر تیترها و عناوین ، هدف خود یا نویسنده ، برای خودت سوال ایجاد کن . میدونی دلیلش چیه؟\n" +
                        " طبق اثر زایگارنیک زمانی که در ذهن انسان سوال ایجاد بشه ، مطالب خیلی بهتر در ذهن باقی می مونن.\uD83D\uDE09✨\n" +
                        "3.خواندن: در این مرحله علاوه بر خواندن باید یادداشت برداری هم انجام بدی. مواظب باش که اصلا به عقب برنگردی و هرجا رو متوجه نشدی فقط یه علامت بزن . توجه داشته باش که فقط 20 الی 30 درصد زمان صرف خواندن میشه و 70الی 80 درصد، صرف یادداشت برداری میشه.\n" +
                        "یادداشت برداری 2 مرحله  داره :️\uD83C\uDFFB\uD83D\uDE04\n" +
                        "مرحله اول: یادداشت برداری خام که یعنی جدا کردن مطالب مهم از غیر مهم  و بدون نظم خاصی .\n" +
                        "مرحله دوم: ترسیم نقشه ذهنی و قرار دادن کلمات کلیدی در اون\n" +
                        "\n" +
                        "4.بازنگری : در این مرحله  فرصت داری تا هر جا رو که علامت زدی و متوجه نشدی ، دوباره مطالعه کنی.✅\n" +
                        "\n" +
                        "5.الگو یادآوری: در واقع این بخش به نقشه ذهنی اشاره داره. در نقشه ذهنی موضوع اصلی در وسط و جزئیات مهم بر روی خط های هایی که از موضوع اصلی سرچشمه میگرن، نوشته میشه و سپس نکات فرعی، روی خط هایی که از جزئیات مهم سرچشمه میگرن نوشته میشه. بهتره هر بخشی  یک رنگ خاص داشته باشه تا بهتر در ذهن نقش ببنده.\uD83D\uDE0C\n" +
                        "\n" +
                        "6. تفکر و امتحان: در این قسمت، باید از حالت منفعل به فعال تبدیل بشی یعنی مثلا از مطالبی که خوندی از خودت امتحان بگیر و یا برای یک نفر توضیح بده.\n" +
                        "\n" +
                        "7. مرور : در مرحله آخر با استفاده از نقشه ذهنی و خلاصه هات مطالبی که خوندی رو مرور کن.\uD83E\uDD1D✨\n",
                "https://uploadkon.ir/uploads/673c05_24سیستم-مطالعاتی-۲۰۲۳-۰۵-۱۸-۱۸-۱۸-۲۷-۳۳۳.mp3"
            ),

            DataEducation(
                "https://s6.uupload.ir/files/5100731-removebg-1_ye3j.png",
                "تکنیک سوپر مرور",
                "جوری مرور کن که دیگه هیچ وقت مطالب یادت نرن!",
                "سلام رفیق✋\uD83C\uDFFB\n" +
                        "در این آموزش میخوام تکنیک سوپر مرور رو بهت بگم که دیگه مطالب فراموشت نشن.\uD83D\uDE0E\uD83E\uDD1D \n" +
                        "طبق نمودار فراموشی ابینگ هاوس وقتی5 بار مرور کنی دیگه اطلاعات توی ذهنت ثبت میشن . \n" +
                        "حالا اگر میخوای مرور کنی بهت این تکنینک رو که بازه زمانیش یک هفته هست پیشنهاد میکنم.\uD83D\uDE0E\uD83D\uDC4D\uD83C\uDFFB\n" +
                        "\n" +
                        "روز اول (شنبه): خواندن مطلب جدید(A)\n" +
                        "\n" +
                        "روز دوم (یکشنبه): ابتدا مرور مطلب روز شنبه(A) ، سپس خواندن مطلب جدید(B)\n" +
                        "\n" +
                        "روز سوم (دوشنبه): ابتدا مرور مطلب روز شنبه و یکشنبه(A و B)  ، سپس خواندن مطلب جدید(C)\n" +
                        "\n" +
                        "روز چهارم (سه شنبه): ابتدا مرور مطلب روز شنبه و یکشنبه و دوشنبه (A  و B و C) ، سپس خواندن مطلب جدید(ِD) و مرور مطلب روز یکشنبه و دوشنبه و سه شنبه ( B و C و D) در آخرشب\n" +
                        "\n" +
                        "روز پنجم(چهارشنبه): ابتدا مرور مطلب روز دوشنبه و سه شنبه (C  وِD) ، سپس خواندن مطلب جدید(E) و مرور مطلب روز سه شنبه و چهارشنبه (D و E) در آخرشب\n" +
                        "\n" +
                        "روز ششم (پنجشنبه): ابتدا مرور مطلب روز چهارشنبه (ٍE) ، سپس خواندن مطلب جدید(F) و مرور مطلب روز چهارشنبه و پنجشنبه (E و F) در آخرشب\n" +
                        "\n" +
                        "روز هفتم (جمعه): ابتدا مرور مطلب روز پنجشنبه(E) ، سپس مرور مطالب روز شنبه ، یکشنبه، دوشنبه، سه شنبه و چهارشنبه ( A و B  و C  و D و E و F)  و مرور مطالب  کل هفته در آخرشب\n" +
                        "\n" +
                        "و در آخر لازمه که به یک نکته توجه کنی✅. \n" +
                        "در اینجا شاید با خودت فکر کنی که این مرور ها زمان زیادی ازت می گیره در حالی که مرور هر قسمت باید کمتر از 5 دقیقه باشه ؛ پس نیاز نیست وسواس به خرج بدی. .\uD83D\uDE01✋\uD83C\uDFFB\n" +
                        "راستی برای مرور میتونی از خلاصه هات استفاده کنی تا وقت کمتری ازت بگیره.\uD83D\uDC4D\uD83C\uDFFB",
                "https://uploadkon.ir/uploads/7c7405_24سوپر-مرور-اصلی-۲۰۲۳-۰۵-۱۸-۰۱-۲۳-۱۶-۷۹۰.mp3"
            ),
            DataEducation(
                "https://s6.uupload.ir/files/7561084-removebg-preview_0aj.png",
                "تکنیک های حافظه",
                "کلی چیز رو به خاطرت بسپار بدون اینکه فراموششون کنی!",
                "سلام رفیق✋\uD83C\uDFFB\n" +
                        "توی این بخش میخوام بهت 3 تا تکنیک حافظه فوق العاده بگم تا بتونی به راحتی کلمات رو حفظ کنی\uD83D\uDE0E\n" +
                        "تکنیک زنجیر: برای استفاده از این تکنیک باید تصویر سازی کنی . مثلا اگر میخواهی 4 تا کلمه حفظ کنی باید برای کلمه اول و دوم ، دوم و سوم ، سوم و چهارم یک تصویر مجزا بسازی . تصویر هایی که می سازی حتما باید مسخره، خنده دار و اغراق آمیز باشن \uD83D\uDE43سعی کن خودت هم توی اون تصویر باشی و با جزئیات اون رو توی ذهنت ثبت کنی. \n" +
                        "یک مثال برات میزنم تو خوب برات جا بیوفته. مثلا میخوای 3 کلمه قایق، موز وگنجشک  رو حفظ کنی. اول برای قایق و موز یه تصویر می سازی. برای مثال:«یک قایق بود که بدنش از موز درست شده بود و ماهیا سعی داشتن از اون موزا بخورن ».حالا برای موز و گنجشک یک تصویر می سازی. برای مثال :«یه گنجشکی بود که وقتی نزدیکش می شدی از بوی موز مدهوش می شدی تازه سرش هم شیبه ته موز بود». \n" +
                        "برای تصویر سازی باید به چند نکته دقت کنی: \n" +
                        "1. از قوه تخیلت استفاده کن  و تصویر های عجیب و غریب و مسخره بساز حتی اگر آدم جدی ای هستی.\n" +
                        "2. اولین تصویری که به ذهنت اومد رو شکار کن.\n" +
                        "3.شاید اولش براتون وقت گیر باشه ولی به تدریج و با تمرین کردن میتونید خیلی سریع کلمات رو به خاطر بسپارید .\n" +
                        "4. حافظه هم مثل سایر اندام برای قوی شدن نیاز به تمرین و ورزش داره ؛ پس صبور باش\uD83E\uDD1D✨\n" +
                        "حالا که این تکنینک رو یادگرفتی 15کلمه رو بنویس و سعی کن توی 2 دقیقه اونها رو به خاطر بسپاری . \n" +
                        "اگر تونستی که خیلی عالیه . برای تمرین بعدی تعداد کلمات رو بیشتر کن.\n" +
                        "اگر هم نتونستی فدای سرت . تمرین کن تا بتونی\uD83D\uDC4C\uD83C\uDFFB\uD83D\uDE04\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "تکنینک کدینگ : دراین تکنینک اول  باید برای هر عدد یک کد بزاری این کد ها تصویر اجسامی هستند که به اون عدد شبیه هستن. مثلا کد های عدد 0 تا10 رو میتونی به این صورت انتخاب کنی\uD83D\uDC47\uD83C\uDFFB\uD83D\uDE01:\n" +
                        "عدد 0 =توپ(گرده. شبیه عدد 0 هست)⚽\n" +
                        "عدد1=عصا (بلند و درازه . شبیه عدد1)\uD83E\uDE84\n" +
                        "عدد2=ترازو(2کفه داره)⚖\n" +
                        "عدد3=چراغ راهنمایی(3رنگ داره)\uD83D\uDEA6\n" +
                        "عدد4=چهار راه(4 تا راه داره)\uD83D\uDEE3\n" +
                        "عدد5=ستاره(5گوشه داره)⭐\n" +
                        "عدد6=تاس(6وجه داره)\uD83C\uDFB2\n" +
                        "عدد7=هفت تیر (از اسمش مشخصه)\uD83D\uDD2B\n" +
                        "عدد8=کوه(شکلش شبیه عدد 8)⛰\n" +
                        "عدد9=سوت (سوت شبیه عدد 9)\n" +
                        "عدد10=کامیون 10 (10 تا چرخ داره)\uD83D\uDE9B\n" +
                        "اینها صرفا مثال هستن . تو میتونی اجسام دیگه ای رو انتخاب کنی. \n" +
                        "توی مرحله بعد اگر مثلا بخوای  3 تا کلمه مثل  فرش ، میز و دوچرخه  رو حفظ کنی، برای کلمه اول باید با عصا که کد شماره 1 هست و فرش یه تصویر بسازی . برای کلمه دوم باید با ترازو که کد شماره 2 هست و میز یک تصویر بسازی و در آخر برای کلمه سوم با چراغ راهنمایی که کد عدد 3 هست  و دوچرخه یک تصویر دیگه بسازی. \n" +
                        "دقت داشته باش که تصاویرت مشخصاتی که توی تکنیک قبلی گفتم رو داشته باشن.\uD83D\uDE09\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        " تکنینک اتاق رومی: یک مکان مثل خونه رو در تصور کن  و تمام قسمت های اون رو به ترتیب حفظ کن حالا به ترتیب با هر کلمه و یک قسمت از اون مکان تصویر بساز. کلمه اول با اولین قسمت خانه ، دومین کلمه با قسمت دوم خانه و... \n" +
                        "برای مثال وقتی وارد خونه میشی اول یه در داره بعد حیاط و بعد باغچه و... حالا اگر بخوای 3 کلمه مثل  مورچه – موشک – روزنامه رو حفظ کنی با در و مورچه ، موشک و حیاط  ، روزنامه و مورچه تصویرسازی کنی .\n" +
                        "بازهم استفاده از نکات تصویر سازی در تکنیک اول یادت نره.\uD83D\uDE09\n" +
                        "\n" +
                        "شاید برات سوال باشه که چرا همش باید تصویر بسازیم\uD83D\uDE01\n" +
                        "اقای کوین ترودا میگه :\n" +
                        "تصاویر پایه های فکری ما هستند ؛ یعنی تصاویر افکار ما رو می سازند . هر وقت تصویر نباشد تفکر هم صورت نمی گیرد.\n" +
                        "\n" +
                        "\n" +
                        "در آخر لازم دونستم چند تا نکته رو یادآور بشم :\uD83D\uDC4C☺️\n" +
                        "1.شاید اولین بار که انجام بدی به نظر وقت گیر بیاد ولی وقتی تمرین کنی متوجه میشی که چقد راحت و در مدت زمان کم میتونی کلمات رو به خاطر بسپاری.\n" +
                        "2.تعداد کلماتی که برای مثال گفتم صرفا برای مثال بود .تو می تونی کلمات خیلی بیشتری رو حفظ کنی.\n" +
                        "3.حتما تصاویرت مشخصاتی مانند اغراق ، خنده دار بودن و عجیب و غریب بودن رو داشته باشن.",
                "https://uploadkon.ir/uploads/1ede05_24تقویت-حافطه-۲۰۲۳-۰۵-۱۸-۰۱-۱۱-۳۷-۸۸۵.mp3"
            ),
            DataEducation(
                "https://s6.uupload.ir/files/4904579-removebg-preview1_aln4.png",
                "تکنیک های تمرکز",
                "به سادگی تمرکزت رو به حداکثر برسون!",
                "سلام دوست عزیز✋\n" +
                        "در این بخش می خوام چند تا تکنیک تمرکزبهت بگم تا دیگه بتونی با خیال راحت و تمرکز هر چه تمام تر مطالعه کنی و به کارهات برسی. هرکدوم رو دوست داشتی میتونی استفاده کنی و لذت ببری. \n" +
                        "\n" +
                        "اول از همه بزار بهت بگم چه مواقعی تمرکز کم میشه:\n" +
                        "1.عجله \n" +
                        "2.شرایط دشوار\n" +
                        "3.استرس و اضطراب \n" +
                        "4.احساست بسیار قوی\n" +
                        "5.موازی کاری (در عین حال چند کار انجام دادن)\n" +
                        "6.خستگی \n" +
                        "7.عدم اعتماد به نفس\n" +
                        "\n" +
                        "\n" +
                        "1.تکنینک صندلی تمرکز : یه صندلی در نظر بگیر و مطالعه یا هر کاری که مد نظرت هست رو فقط روی اون صندلی انجام بده و از وقتی که میشنی تا وقتی که بلند میشی رو زمان بگیر . اگر هم هر کاری غیر از کار مدنظرت خواستی انجام بدی از روی صندلی بلند شو و زمانت رو متوقف کن. حالا آخر شب ببین این همون مدت زمانیه که میخواستی به کارت بپیردازی یانه. مطمئن باش دیگه از اون به بعد کارهای غیر مهمت رو حذف می کنی.\n" +
                        "\n" +
                        "2.تکنیک کشوی ذهنی: قراره با این تکنیک پرونده های باز ذهنت رو ببندی. برای این کار یه برگه بردار و تمام چیزاهایی که ذهنت رو مشغول کرده رو توی برگه هایی جداگانه با جزئیات بنویس. راستی ، دقت کن که فقط 3 دقیقه زمان داری. حالا اگر نتونستی توی 3 دقیقه این کارو انجام بدی یه وقت اضافه 2 دقیقه ای به خودت بده. مطمئن باش نتیجه میگیری.\n" +
                        "\n" +
                        "3.تکنینک حواسپرتی اختیاری: 6تا جسم رو انتخاب کن و به تمام جزئیاتشون فکر کن . برای هر جسم 10 ثانیه فرصت داری .\n" +
                        "\n" +
                        "4.تمرین شمارش معکوس : برای این تمرین باید یک عدد رو در نظر بگیری و به هر اندازه ای که دوست داری ازش کم کنی. مثلا از عدد 300 ، 3تا3تا کم کن تا به عدد1 برسی.\n" +
                        "\n" +
                        "5.تمرین آدم برفی: در 2 دقیقه یک آدم برفی رو تصور کن و توی ذهنت اون رو آب کن. راستی یه نکته ، هرچقدر دیرتر آدم برفی رو آب کنی بهتره\n" +
                        "\n" +
                        "6.تکنیک گوش کردن : اول از همه چشمان خودت رو ببند و در جایی بشین. تمرکزت رو روی هوای ورود و خروج از بینیت قرار بده، سپس بدون هیچ گونه قضاوتی به صداهای اطرافت گوش کن، طوری که انگار فقط گوش تو دریافت کننده این صداهاست.\n" +
                        "\n" +
                        "7.تمرین ساعت و تلویزیون: به مدت 5 ثانیه  جلوی تلویزون روشن، روی عقربه ثانیه شمار ساعت تمرکز کن و به مرور زمان رو بیستر کن \n" +
                        "\n" +
                        "حالا میخوام توی این بخش یه چند تا نکته کوچیک بهت بگم که تمرکزت رو بالا ببری:\n" +
                        "1.کارهات رو به تعویق ننداز\n" +
                        "2.استفاده از راهنمای تصوری \n" +
                        "3.منظم باش\n" +
                        "4.کسب آرامش\n" +
                        "5.به بهانه انگیزه نداشتن منتظر نمون(یادت باشه انگیزه از اقدام به وجود میاد)\n" +
                        "6.کارهات رو به بخش های کوچکتر تقسیم کن\n" +
                        "7.وقتی با کارهات رو به رو شدی به مزایاش فکر کن نه مشکلات \n" +
                        "8.قبل از انجام کاری ، اول اون رو تمرین کن\n" +
                        "8.هرگز خودت رو به خاطر هوش پایین سرزنش نکن\n" +
                        "10.استراحت یادت نره",

                "https://uploadkon.ir/uploads/1cc305_24تکنینک-تمرکز-۲۰۲۳-۰۵-۱۸-۱۸-۴۲-۰۶-۲۱۱.mp3"
            ),
            DataEducation(
                "https://s6.uupload.ir/files/4584-removebg-preview_xxed.png",
                "برنامه ریزی به روش آی وی لی ",
                "به بهترین شکل کاراتو برنامه ریزی کن!",
                "سلام دوست من✋\n" +
                        "در این قسمت میخوام یک روش برنامه ریزی برای به حداکثر رساندن بهره وری بهت آموزش بدم این روش رو آقای آی وی لی ارائه دادن.\uD83D\uDE0E✨\n" +
                        "\n" +
                        "1.در پایان هر روز 6 فعالیت مهم فردا را یادداشت کن و  بر اساس اولویت بنویس.\n" +
                        "2. با اومدن  فردا بر اولین اولویت تمرکز کن و تا تمام نشده سراغ بعدی نرو. \n" +
                        "3.همین روال برای بقیه کارها پیش ببر ، هر کار ناتمام ماند به لیست فردا انتقال  بده.\n" +
                        "4. این فعالیت را در هر روز کاری تکرار کن.\n" +
                        "\n" +
                        "\n" +
                        "راستی  چندتا نکته هست که بهتره بهشون توجه کنی:\uD83D\uDC4C\uD83D\uDE0A\n" +
                        "1.مهمترین کارهات رو در ابتدای روز انجام بده. چون: \n" +
                        "\uD83D\uDD35عزم و اراده در ابتدای روز بیشتره. \n" +
                        "\uD83D\uDD35هر چه روز جلوتر می ره ، احتمال به هم ریختن برنامه یا فعالیت های ثانویه بیشتر می شه.\n" +
                        "\uD83D\uDD35ذهن انسان از پروژه های نیمه تمام بیزاره.\n" +
                        "2.هیچ گاه قبل از ظهر گوشیت رو چک نکن و به فضای مجازی نرو.\n" +
                        "3.به جای کارایی، بر اثر بخشی تمرکز کن.\n" +
                        "4سلام دوست من✋\n" +
                        "در این قسمت میخوام یک روش برنامه ریزی برای به حداکثر رساندن بهره وری بهت آموزش بدم این روش رو آقای آی وی لی ارائه دادن.\uD83D\uDE0E✨\n" +
                        "\n" +
                        "1.در پایان هر روز 6 فعالیت مهم فردا را یادداشت کن و  بر اساس اولویت بنویس.\n" +
                        "2. با اومدن  فردا بر اولین اولویت تمرکز کن و تا تمام نشده سراغ بعدی نرو. \n" +
                        "3.همین روال برای بقیه کارها پیش ببر ، هر کار ناتمام ماند به لیست فردا انتقال  بده.\n" +
                        "4. این فعالیت را در هر روز کاری تکرار کن.\n" +
                        "\n" +
                        "\n" +
                        "راستی  چندتا نکته هست که بهتره بهشون توجه کنی:\uD83D\uDC4C\uD83D\uDE0A\n" +
                        "1.مهمترین کارهات رو در ابتدای روز انجام بده. چون: \n" +
                        "\uD83D\uDD35عزم و اراده در ابتدای روز بیشتره. \n" +
                        "\uD83D\uDD35هر چه روز جلوتر می ره ، احتمال به هم ریختن برنامه یا فعالیت های ثانویه بیشتر می شه.\n" +
                        "\uD83D\uDD35ذهن انسان از پروژه های نیمه تمام بیزاره.\n" +
                        "2.هیچ گاه قبل از ظهر گوشیت رو چک نکن و به فضای مجازی نرو.\n" +
                        "3.به جای کارایی، بر اثر بخشی تمرکز کن.\n" +
                        "4.با جعبه آیزنهاور بهره وری خودت رو افزایش و فعالیت های هدر دهنده ی زمان را کاهش بده..با جعبه آیزنهاور بهره وری خودت رو افزایش و فعالیت های هدر دهنده ی زمان را کاهش بده. ",
                "https://uploadkon.ir/uploads/d37805_24برنامه-ریزی-اصلی-۲۰۲۳-۰۵-۱۸-۰۰-۳۷-۴۹-۵۸۹.mp3"
            ),
            DataEducation(
                "https://uploadkon.ir/uploads/591005_245385957-removebg-preview.png",
                "مدیریت زمان",
                "زمانت رو به بهترین شکل مدیریت کن", "سلام دوست عزیز من✋\n" +
                        "توی این بخش میخوام نکاتی رو درباره مدیریت زمان بهت بگم.\n" +
                        "\n" +
                        "اول از همه می خوام بهت بگم چه افرادی دچار کمبود زمان میشن:\n" +
                        "1-  کسانی که هیچ کاری را شروع نکنند و مدام اهداف بزرگتری داشته باشند.\n" +
                        "2- افرادی که اولویت بندی کارها رو ندارن.\n" +
                        "3- کسانی که کارها رو واگذار نکنن.\n" +
                        "4- کسانی که وسواس دارن و کمال گرا هستن.\n" +
                        "5- کسانی که تنبل و اهمال کار هستن.\n" +
                        "6- کسانی که توان نه گفتن رو ندارن.\n" +
                        "7-کسانی که مدیریت انرژی رو نمی دونن.\n" +
                        "\n" +
                        "حالا میخوام تو رو با یک قانون مدیریت زمان به اسم «قانون گروگان گیری» آشنا کنم.\n" +
                        "اول یکم عمیق تر به برنامه ریزی زندگیت و این قانون نگاه کن، قانون گروگان گیری زمان میگه:تو خیلی راجب زمانت دست و دل باز فکر می کنی. مثلا صبح که بیدار می شی میگی:« من کلی وقت دارم، حالا کو تا شب!!» یک عالمه کار های متفرقه و بی خود انجام می دی و کار اصلی رو می زاری کنار، به خیال اینکه بعدا دونه دونه بهشون می رسی؛ اما در حقیقت تو در دست یک سری عادت های روزمره و دست و پاگیر اسیری شدی .40 درصد زندگی تو، دست عادت هاته وبه خاطر این عادت های بی خود اسیر شدی . \n" +
                        "داخل ذهنت یک زندانی رو تصور کن که بهش دو ساعت وقت دادن  تا به هر کاری که داره برسه و برگرده. به نظرت اون چطور از این دو ساعت به نحو احسنت استفاده میکنه؟! حالا این قانون میگه تصور کن که تو رو برای دو ساعت آزاد گذاشتن و بهت فرصت دادن تا به کارهای مهم زندگیت برسی ولی دوباره گروگان می گیرنت و زندانیت می کنن . تصور کن مثل یک زندانی باید تلاش کنی تا مهم ترین و بهترین کارهات رو اولیت قرار بدی.\n" +
                        " حتما این روش رو استفاده کن تا ببینی چقدر بهره وریت از زمان افزایش پیدا میکنه و در یک ماه به چندین ساعت می رسه!!. ببین چقدر کارهای مفیدی انجام دادی و سعی کن کارهایی که انجام میدی متمرکز باشه و پراکنده نباشه.\n" +
                        "\n" +
                        "راستی، یه نکته، پیدا کردن سارقین زمان، یک موضوع مهم در مدیریت زمانه پس برای این موضوع باید یه کاری انجام بدی. حالا به نظرت اون کارچیه؟\uD83E\uDD14\uD83D\uDE43\n" +
                        "تو باید در این تکنیک کارآگاه بازی در بیاروری و یک هفته به صورت دقیق خودت رو زیر نظر بگیری و در یک جدول که تمام روزهای هفته و از ساعت 7 تا11 نوشته شده،یادداشت کنی . توجه داشته باش که هر ساعت هر کاری که انجام دادی باید بنویسی. مثلا شنبه ساعت 9تا10 درس خوندی، 10تا11 باموبایل کار کردی و...\n" +
                        "حالا بعد یک هفته به جدولت نگاه کن.کدوم کار بیشترین زمان رو از تو گرفته؟ایا برنامه روزانت مناسبه؟چه زمان هایی می تونی بهتر به کارهات برسی؟ایا تفریحت به اندازه بوده؟ مطالعت چطور؟ و خیلی چیزهای دیگه که میتونی با استفاده از این جدول متوجه بشی.\n" +
                        "\n" +
                        ".5 :نکته طلایی برای استفاده\u200Cی بهتر از زمان\n" +
                        "1- مواردی را که دقتت را می\u200Cگیره رو مشخص کن و در کنار اون یک مقوای کوچک به عنوان ناظم قرار بده.\n" +
                        "2-  زمان استفاده از تلویزیون و فضای مجازی را محدود کن.\n" +
                        "3- از افراد دارای استرس که بهت سیگنال منفی میدن دوری کن.\n" +
                        "4- سعی کنید ساعت بیولوژیک بدنت رو تنظیم کن که در ساعت خاصی بخوابی و بیدار بشی.\n" +
                        "5- با کنجکاوی و سوال پرسیدن، دقت و تمرکز حواس و قوه تخیل (خلاقیت) رو زیاد کن.\n" +
                        "\n" +
                        "3 راه برای غلبه بر قانون پارکینسون:\n" +
                        "✓ وظایف و کارهای مختلف را بخش بخش کن.\n" +
                        "✓ جایزه ای برای خودت تعیین کن.\n" +
                        "✓ گام بعدی رو ترسیم کن.\n",
                "https://uploadkon.ir/uploads/b8ad05_24مدیریت-زمان-۲۰۲۳-۰۵-۱۸-۰۱-۱۹-۰۰-۰۵۷.mp3"
            )


        )
        val AdapterEducation = AdaptorEducation(dataEducation, this)
        binding.recyclerHomeEducation.adapter = AdapterEducation
        binding.recyclerHomeEducation.layoutManager =
            LinearLayoutManager(context, RecyclerView.HORIZONTAL, false)
    }

    private fun runTopMan() {
        val dataTopMan = arrayListOf<DataTopMan>(
            DataTopMan(
                "https://s6.uupload.ir/files/pic_4_1_as69.jpg",
                "دکتر محمود حسابی",
                "پدر علم فیزیک",
                "محمود حسابی (زاده ۳ اسفند ۱۲۸۱ در تهران – درگذشت ۱۲ شهریور ۱۳۷۱ در ژنو) با نام اصلی محمود خان میرزا حسابی یک فیزیکدان و، سناتور هسته ای ایران بود، دکتر حسابی وزیر آموزش و پرورش ایران در کابینه نخست وزیر محمد مصدق بود وی در زمان سلطنت پهلوی و بنیان\u200Cگذار فیزیک و مهندسی دانشگاهی در ایران بود.\n" +
                        " \n" +
                        "حسابی در تهران در خانواده عباس و گوهرشاد حسابی متولد شد. زادگاه خانواده وی تفرش ، در استان مرکزی ، ایران است. در سن چهار سالگی ، خانواده وی به بیروت نقل مکان کردند و در آنجا حسابی در دبستان تحصیل کرد. او هنوز در دوران دبیرستان بود که جنگ جهانی اول شروع شد و مدارس فرانسوی زبان تعطیل شدند. حسابی تحصیلات خود را 2 سال در خانه ادامه داد و در سال 1922، وی مدرک مهندسی راه را از دانشگاه آمریکایی بیروت به دست آورد.\n" +
                        " \n" +
                        "در سن هفده سالگی لیسانس ادبیات، و در سن نوزده سالگی لیسانس بیولوژی را اخذ نمود. پس از آن در رشته مهندسی راه و ساختمان از دانشکده فرانسوی مهندسی در بیروت فارغ التحصیل شد. در آن دوران با اشتغال در نقشه کشی و راهسازی، به امرار معاش خانواده کمک می\u200Cکرد. او همچنین در رشته\u200Cهای پزشکی، ریاضیات و ستاره شناسی به تحصیلات دانشگاهی پرداخت. پس از مدت كوتاهی كار برای وزارت راه بیروت پیدا کرد.\n" +
                        " \n" +
                        "شرکت راهسازی فرانسوی که او در آن مشغول به کار بود، به پاس قدردانی از زحماتش، وی را برای ادامه تحصیل به فرانسه اعزام کرد. در سال ۱۹۲۴ میلادی به مدرسه عالی برق پاریس راه یافت و در سال ۱۹۲۵ میلادی فارغ التحصیل شد.\n" +
                        " \n" +
                        "حسابی برای تحصیلات بیشتر به پاریس سفر كرد ، وی در رشته مهندسی برق در و بعداً درجه دكترا در سال 1927 به وی اعطا شد.\n" +
                        " \n" +
                        "در تهران ، حسابی وابسته به دانشگاه تهران بود و دانشکده های علوم و مهندسی دانشگاه را مدیریت می کرد، او در زمان تحصیل در دانشگاه ، معلم النوش تریان بود . در ژوئن سال 1951 ، حسابی در یک هیئت استانی سه نفره شرکت نفت ایران شرکت کرد و به جانشین تعیین شده شرکت نفت انگلیس-ایران منصوب شد. در دسامبر سال 1951 ، وی به عنوان وزیر آموزش و پرورش جایگزین کریم سنجابی شد. بین سال های 1961 و 1969 ، حسابی نماینده ایران در کمیته علمی و فنی ، کمیته سازمان ملل در استفاده صلح آمیز از فضای بیرونی بود.\n" +
                        " \n" +
                        "طی سال\u200Cها تحقیق و مطالعات علمی در دانشگاههای معتبر عالم با دانشمندان بزرگ جهان نظیر پرفسور \"انیشتین\"، \"شرودینگر\"، \"بورن\"، \"فرمی\" و چندین فیزیکدان دیگر و همچنین علمای بزرگ مانند \"راسل\" و \"آندره ژید\" همکاری و تبادل نظر داشته و تنها ایرانی شاگرد پروفسور \"آلبرت اینشتین\" بود.\n" +
                        "\n" +
                        "\n" +
                        "                                    همیشه هر چیزی را که دوست داریم به دست نمی آوریم، \n" +
                        "                                    پس بیاییم آنچه را که به دست می آوریم دوست بداریم .  \n" +
                        "                                   «دکتر محمود حسابی»\n"
            ),
            DataTopMan(
                "https://s6.uupload.ir/files/biography-alberteinstein-3203_bnap.jpg",
                "آلبرت انیشتین",
                "فیزیکدان",
                "آلبرت اَینشتَین  (۱۴ مارس ۱۸۷۹ – ۱۸ آوریل ۱۹۵۵) فیزیک\u200Cدان نظری زادۀ آلمان بود. آلبرت انیشتین بسیار به نوازندگی علاقه مند بود و یادگیری ویولون را از ۵ سالگی آغاز کرد، و این نابغه ی جوان علاقه ی زیادی به این ساز پیدا کرده بود و در سال های جوانی تا باقی عمرش به نواختن آن ادامه داد.اینشتین هم به کسب و کار خانوادگیشان ملحق شد اما با ورشکستگی آن ها مجبور شدند به شمال ایتالیا جا به جا شوند و در آنجا بود که انیشتین نوجوان مقاله ای نوشت که اکنون به عنوان اولین مقاله ی علمی او شناخته می شود. این مقاله به بررسی ماهیت اتر می پرداخت، و این فرضیه  براساس توصیف چگونگی حرکت نور در فضا بود و انیشتین بعدها آن را رد کرد. و جالب است بدانید آلبرت انیشتین تا پایان عمر خود بیش از 300 مقاله ی علمی منتشر کرد.\n" +
                        "انیشتین در سال 1900 با کسب مدرک تدریس فیزیک از دانشگاه پلی تکنیک زوریخ در سوئیس فارغ التحصیل شد. او در دروس فیزیک نظری، استعداد قابل توجهی داشت اما نمرات ریاضی اش در آن حد خوب نبود. بعدها که سنش بیشتر شد در مورد این موضوع گفت: برای من دانشجو مشخص نبود که دانش پیچیده ی قواعد بنیادین فیزیک، تا این حد با متدهای پیچیده ریاضیات گره خورده است.انیشتن زمانی که به دلیل تحصیل در دانشگاه پلی تکنیک در زوریخ سوئیس به سر می برد با میلوا آشنا شده بود که هم دوره ای فیزیک او بود اما هیچ گاه درسش را به پایان نرساند. آن ها در سال 1903 با هم ازدواج کردند. اولین پسر آن ها هانس آلبرت اینشتین نام داشت.اما او حتی با وجود مدرک تدریس فیزیک هم نتوانست در دانشگاهی شروع به تدریس کند و از تلاش برای ادامه تحصیل در مقطع دکترا دست کشید. اما گرفتن مدرک دکترا می توانست در پیدا کردن شغل مناسب به او کمک کند اما آلبرت در عوض سال 1903 به عنوان کارمند اداره ی ثبت مالکیت معنوی اختراعات در برن آلمان مشغول به کار شد. دو سال بعد بود که نظریه ی نسبیت خاص خود را منتشر کرد.\n" +
                        "\n" +
                        "\n" +
                        "                                            از دیروز یاد بگیرید\n" +
                        "                                           برای امروز زندگی کنید           \n" +
                        "                                           به فردا امیدوار باشید\n" +
                        "                                           «آلبرت انیشتین»    "
            ),
            DataTopMan(
                "https://s6.uupload.ir/files/بیوگرافی-پروفسور-سمیعی_v1rw.jpg",
                "پرفسور مجید سمیعی",
                "جراح مغز و اعصاب",
                "پروفسور مجید سمیعی درتاریخ  29 خرداد 1316 در شهر تهران و در خانواده ای فرهیخته چشم به جهان گشودند.ایشان پس از اتمام تحصیلات دوره دبیرستان در ایران راهی کشور آلمان شدند و در دانشگاه ماینتز در رشته پزشکی مشغول به ادامه تحصیل گردیدند. نظر به موفقیتهای علمی ایشان در دوران تحصیلات پزشکی و کسب عالیترین نمرات ممکن در امتحانات پایان دوره پزشکی، جایزه ویژه وزارت علوم ایران برای برترین دانشجویان ایرانی مقیم اروپا به ایشان تعلق گرفت. پس از فراغت از تحصیل در رشته پزشکی و همچنین اتمام تحصیلات ثانوی در بیولوژی، ایشان تحصیلات تخصصی خود در رشته جراحی مغز و اعصاب را در دانشگاه ماینتزآغازنمودند و در سال 1970 موفق به دریافت مدرک بورد تخصصی این رشته از کشور آلمان شدند.\n" +
                        "در آوریل 1970 و تنها در سن 32 سالگی ایشان موفق به دریافت عنوان دانشیاری در رشته جراحی مغز و اعصاب گردیدند و فعالیت خویش را بعنوان معاون دپارتمان جراحی مغز و اعصاب دانشگاه ماینتز ادامه دادند. یکسال بعد و در سال 1971 ایشان موفق به دریافت عنوان استادی (پروفسور) در رشته جراحی مغز و اعصاب گردیدند. در این سال پیشنهاد عنوان استادی و ریاست دپارتمان رشته جراحی مغز و اعصاب دردانشگاه ملی ایران (دانشگاه شهید بهشتی کنونی) به ایشان داده شد. لیکن ایشان جهت ادامه فعالیت علمی خود در دانشگاه ماینتز از پذیرش این سمت مهم امتناع نمودند. در سال 1977 ایشان ریاست دپارتمان جراحی مغز و اعصاب در بیمارستان نورداشتات در هانوفر آلمان را پذیرفتند، سمتی که ایشان تا سال 2003 عهده دار آن بودند.\n" +
                        " از سال 1996 ایشان ریاست هر دو دپارتمان جراحی مغز و اعصاب در بیمارستان نورداشتات و دانشگاه پزشکی هانوفر را عهده دار شدند. در سال 2000 پروفسور سمیعی موسسه بین المللی علوم اعصاب را در هانوفر بنیان نهادند و ریاست آنرا برعهده گرفتند. در سال 2003 ایشان بازنشستگی خود از ریاست دپارتمانهای جراحی مغز اعصاب در بیمارستان نورد اشتات و دانشگاه پزشکی هانوفر را اعلام نموده و خود را وقف توسعه موسسه بین المللی علوم اعصاب نمودند. در سال 2004 پروفسور سمیعی همچنین ریاست موسسه بین المللی علوم اعصاب چین واقع در دانشگاه پزشکی پایتخت (Capital Medical University) در پکن را نیز تقبل نمودند. در سال 2010  ساخت موسسه بین المللی علوم اعصاب ایران در تهران برنامه ریزی و عملیات ساختمانی آن آغاز گردید. پروفسور مجید سمیعی بیانگذار و رئیس موسسه بین المللی علوم اعصاب ایران میباشند که در آینده نزدیک راه اندازی خواهد شد.\n" +
                        "پروفسور مجید سمیعی  همچنین در سال 1979 نخستین دوره آموزشی جراحی قاعده جمجمه در جهان را در هانوفر پایه گذاری نمودند. علاوه بر دوره های منظمی که ایشان در آلمان برگزار می نمودند، دوره های آموزشی مشابه دیگری نیز درسایر کشورها در سراسر جهان جهت ارتقای دانش جراحان مغز و اعصاب توسط ایشان پایه گذاری و برگزار گردید.\n" +
                        " در سال 2004 سازمان تامین اجتماعی ایران ریاست دپارتمان جراحی مغز و اعصاب بیمارستان میلاد تهران را به پروفسور مجید سمیعی پیشنهاد نمودند.ازآن پس وبه رهبری ایشان، دوره های آموزشی منسجم و جامعی برای کارکنان دپارتمان برنامه ریزی و اجرا گردید که نتیجه آن تبدیل این دپارتمان به یکی از توسعه یافته ترین و پیشرفته ترین مراکز جراحی مغز واعصاب بوده است. از سال 2006 پروفسور سمیعی سمپوزیوم بین المللی جراحی مغز و اعصاب را بطور مستمردر تهران و به رهبری خود بنیاد نهادند.\n" +
                        "\n" +
                        "\n" +
                        "                                              اگر عقل امروزمو داشتم        \n" +
                        "                                             هیچ وقت اشتباهات دیروزمو نمی کردم\n" +
                        "                                             ولی اگر اشتباهات دیروزمو نمی کردم\n" +
                        "                                             عقل امروزمو نداشتم \n" +
                        "                                             پس باید از اشتباهات نهایت استفاده رو کرد. \n" +
                        "\n" +
                        "                                                                         «پروفسور سمیعی» \n"
            ),
            DataTopMan(
                "https://s6.uupload.ir/files/ifgkx715roof1_gfk1.jpeg",
                "بیل گیتس",
                "موسس ماکروسافت",
                "ویلیام هنری گیتس متولد 28 اکتبر 1955 در سیاتل می باشد . او برنامه نویس، کارآفرین، بازرگان، سرمایه\u200Cدار، نیکوکار و مدیر ارشد اجرایی آمریکایی است که در سال ۱۹۷۵ با مشارکت پل آلن شرکت مایکروسافت را بنیان گذاشت. وی تا دسامبر ۲۰۲۲ با تخمین دارایی خالص ۱۰۷ میلیارد دلار به\u200Cعنوان پنجمین فرد ثروتمند جهان شناخته شد.\n" +
                        " گیتس در خانواده\u200Cای به دنیا آمد که در تجارت و سیاست و خدمات اجتماعی سرشناس بودند. پدر وی ویلیام هنری گیتس دوم وکیل دادگستری و یکی از سرشناسان شهر سیاتل، واشینگتن بود و مادر او آموزگار مدرسه و یکی از اعضای هیئت مدیره یونایتد اینترنشنال بود که در امور خیریه نیز فعالیت داشت. بر خلاف سایرین، او به برنامه\u200Cنویسی با زبان BASIC علاقۀ زیادی داشت. گیتس در مدرسۀ لیکساید در سیاتل تحصیل کرد و چنان شیفتۀ برنامه\u200Cنویسی کامپیوتر بود که برخی برنامه\u200Cها را خراب می\u200Cکرد تا زمان بیشتری را با کامپیوتر بگذراند. بارها استفاده از کامپیوتر را برای او قدغن کردند\n" +
                        "\n" +
                        "بیل گیتس بارها در مصاحبه های خود گفته است که اگر بخواهید راز موفقیت را به ۶ مورد تقسیم کنید اولین مورد پاکسازی افکار منفی و دوری از هرگونه منفی بافی است. اما بنظرتان چطور میتوان به این مهم دست یافت. محققین حوزه موفقیت روش های زیادی را برای پاکسازی افکار منفی عنوان کردن که پرتکرار ترین آنها دوری از افراد منفی باف است. اما اکنون میخواهم تکنیکی را به شما بگویم که تا کنون در هیچ جای دیگر مطرح نشده است و آن تکنیک آشتی با کودک درون در حالت آلفای ذهنی است. حالت آلفای ذهنی وضعیتی است که فرکانس ذهن شما تا ۷ هرتز پایین آمده و نیم کره راست مغزتان فعال شده و وارد ضمیرناخودآگاهتان میشوید. در این حالت هر جمله ای را که تکرار کنید به باورتان تبدیل میشود پس کافیست وارد حالت آلفا شده و جملاتی برعکس آنچه که در موردش منفی بافی میکردید را به زبان بیاورید.(یعنی بر عکس آن جمله منفی که همیشه میگفتید را بگویید)\n" +
                        "\n" +
                        "\n" +
                        " \n" +
                        "                                                به نظر من عشق و علاقه زياد به تداوم در امر يادگيري \n" +
                        "                                                 .عامل بسيار مهمي است \n" +
                        "                                                 من در دوران كودكي آموختم كه \n" +
                        "                                                 زياد كتاب بخوانم.         \n" +
                        "                                               «بیل گیتس»  \n"
            ),
            DataTopMan(
                "https://s6.uupload.ir/files/photo4362259317_kgwb.jpg",
                "هلن کلر",
                "نویسنده",
                "هلن آدامز کلر نمونه\u200Cای قدرتمند از فردی نابینا و ناشنوا بود که در طول زندگی چشمگیر خود توسط عزم، سخت\u200Cکوشی و تخیلش توانست بر سختی\u200Cها پیروز شود. او با غلبه بر شرایط سخت و با پشتکار فراوان، به یک نویسنده، فعال حقوق بشر و فردی مشهور و جهانی تبدیل شد.\n" +
                        "کلر شخصیتی ماندگار را به تصویر می\u200Cکشد که با اراده\u200Cای منحصربه\u200Cفردش و على\u200Cرغم محروم\u200Cبودن از نعمت\u200Cهای بینایی، شنوایی و گویایی توانست به بهترین وجه با محیط اطراف خود فعالانه ارتباط برقرار سازد و حتی به درجات بالای علمی دست یابد.\n" +
                        "در پایتخت ایالات متحده، یک مجسمه برنزی از کلر هفت ساله در کنار پمپ آب وجود دارد که با الهام از تصویری از نقطه عطف واقعی در زندگی او ساخته شده\u200Cاست.\n" +
                        "هلن در ۲۷ ژوئن ۱۸۸۰ در شهر توسکومبیا در شمال غربی آلاباما به\u200Cدنیا آمد. پدر او، آرتور کلر، کاپیتان بازنشسته ارتش و سردبیر روزنامه\u200Cای محلی به\u200Cنام آلابامای شمالی بود و مادرش، کیت کلر، زنی جوان و تحصیل\u200Cکرده بود. کلر اولین دختر آرتور از کیت بود و او دارای دو برادر ناتنی دیگر نیز بود.\n" +
                        "کلر با حواس بینایی و شنوایی به\u200Cدنیا آمد و به\u200Cقدری باهوش بود که از شش ماهگی شروع به صحبت و از یک سالگی شروع به راه رفتن کرد. او هنگامی که ۱۹ ماهه بود به بیماری مبتلا شد که پزشک خانواده آن را تب مغزی نامید. ماهیت واقعی این بیماری هنوز یک راز است و برخی کارشناسان معتقدند که این بیماری ممکن است مخملک یا مننژیت باشد.\n" +
                        "چند روز پس از شروع تب، مادر کلر متوجه شد که دخترش نسبت به حرکات و صداها واکنشی نشان نمی\u200Cدهد. او حواس بینایی و شنوایی خود را از دست داده\u200Cبود.\n" +
                        "\n" +
                        "کودکی هلن کلر:\n" +
                        "هلن فوق\u200Cالعاده باهوش بود و سعی می\u200Cکرد از طریق لمس، بوییدن\u200C و چشیدن\u200C محیط اطرافش را درک کند. او روش محدودی برای ارتباط با همراهانش داشت و توسط زبان اشاره می\u200Cتوانست علامت\u200Cهایی را برای برقراری ارتباط اختراع کند.\n" +
                        "پرتره هلن کلر به عنوان یک دختر جوان، با یک سگ سفید بر روی پایش (اوت ۱۸۸۷)\n" +
                        "با این\u200Cحال در این مدت متوجه شده\u200Cبود که افراد دیگر خانواده به روش دیگری باهم ارتباط برقرار می\u200Cکنند و هنگامی که متوجه حرکت لب\u200Cهای آنها می\u200Cشد احساس خشم می\u200Cکرد.\n" +
                        "او در این مدت بسیار وحشی و سرکش شده\u200Cبود و هنگام عصبانیت شروع به لگد زدن\u200C\u200C و جیغ کشیدن\u200C می\u200Cکرد. برخی افراد خانواده معتقد بودند که او باید در پرورشگاه بزرگ شود.\n" +
                        "کلر بعداً در زندگی\u200Cنامه خود نوشت:\n" +
                        "«نیاز به ارتباط برخی مواقع آنقدر ضروری می\u200Cشد که این سرکشی\u200Cها روزانه و گاهی هر چند ساعت اتفاق می\u200Cافتادند.»\n" +
                        "با وجود اینکه او فشار زیادی را به پدر و مادرش وارد می\u200Cکرد، مادر هلن همچنان امیدوار بود و سخت\u200Cکوشانه دنبال راهی برای تربیت او می\u200Cگشت.\n" +
                        "هلن اولین نوشته خود را هفت روز قبل از اتمام هفت سالگی\u200Cاش کامل کرد. او سریع به تسلط بر حروف الفبای دستی و دستگاه چاپ برجسته خوانندگان نابینا ادامه داد و در خواندن و نوشتن مهارت پیدا کرد. با وجود اینکه در دست\u200Cخط هلن بسیاری از حروف گرد مربعی به\u200Cنظر می\u200Cرسید، از خوانایی خوبی برخوردار بود.\n" +
                        "اولین نامه هلن کلر\n" +
                        "\n" +
                        "در ماه مه سال ۱۸۸۸، سالیوان کلر را به مدرسه نابینایان پرکینز، در بوستون برد. جایی که دنیای جدیدی از دوستی\u200Cهای هلن آغاز شد. او توانست با کودکان نابینا ارتباط برقرار کند و به بازی آنها بپیوندد. او درباره این دیدار نوشت:\n" +
                        "\n" +
                        "    «آه، چه خوشبختی! برای صحبت آزادانه با بچه\u200Cهای دیگر، برای اینکه در این دنیای بزرگ احساس کنید که به جایی تعلق دارید.»\n" +
                        "\n" +
                        "پس از آن دیدار کلر تقریبا هر زمستان را به تحصیل در پرکینز می\u200Cگذراند. او زبان فرانسه، حساب، جغرافیا و موضوعات دیگر را مطالعه کرد. کتابخانه کتاب\u200Cهای برجسته و پرندگان و حیوانات موزه لمسی از جمله مکان\u200Cهای ویژه\u200Cای بود که موردعلاقه هلن قرار گرفت.\n" +
                        "\n" +
                        "هلن در سال ۱۸۹۰ و زمانی که ده ساله بود، ابراز تمایل کرد که صحبت کردن را بیاموزد. سالیوان وی را به دیدن سارا فولر در مدرسه ناشنوایان بوستون برد و فولر برای ۱۱ جلسه به او آموزش داد. پس از آن، سالیوان خودش به هلن آموزش می\u200Cداد. بااین\u200Cحال هلن در طول زندگی\u200Cاش از صدای گفتاری خود که درک آن سخت بود ناراضی بود.\n" +
                        "کلر در مورد روزهای بعدی که با سالیوان داشت نوشت:\n" +
                        "    «من کاری انجام ندادم جز اینکه با دستانم کاوش کردم و نام هر شیئی را که لمس می\u200Cکردم را یاد گرفتم. و هر چه بیشتر با چیزها کار می\u200Cکردم و نام و کاربرد آنها را یاد می\u200Cگرفتم، احساس شادی بیشتری به جهان پیدا می\u200Cکردم و اعتماد به\u200Cنفسم بیشتر می\u200Cشد.»</"
            ),
            DataTopMan(
                "https://s6.uupload.ir/files/seb0xfugja9wqpoq-1_(1)_nfrn.jpg",
                "بریان تریسی",
                "نویسنده و کارآفرین",
                "برایان تریسی زاده شارلوت تاون در جزیره\u200C پرنس ادوارد کانادا، سال ۱۹۴۴ میلادی است. وی در خانواده\u200Cای با ناتوانی\u200Cهای مالی به دنیا آمد. با وجود این، خانواده\u200C تریسی انسان\u200Cهایی اخلاق مدار و درستکار بودند.  شنیدن مداوم جملاتی همچون “پول نداریم” و “ما نمی\u200Cتوانیم هزینه\u200C آن را بپردازیم”  برایان کوچک را در این فکر فرو می\u200Cبرد که چرا کیفیت زندگی پایین\u200Cتری نسبت به دیگران دارند. در نهایت، این ابهامات، دغدغه\u200Cها و نیازهای زندگی او را ناچار به ترک تحصیل در دوران دبیرستان نمود. او در این مرحله از زندگی برای کسب درآمد به کارهای مختلفی مشغول شد. شستن ظروف و نظافت در هتل\u200Cها و رستوران\u200Cها، کار در کارخانه\u200C چوب\u200Cبری و کار فصلی در مزارع از جمله مشاغل طاقت\u200Cفرسایی بود که برایان به آن\u200Cها روی آورده بود.\n" +
                        "در اوایل جوانی، برایان ۲۰ ساله که به قدر کافی زندگی نکرده بود، دل به دریا می\u200Cزند و با پس\u200Cاندازی که از کارهای روزانه جمع کرده بود، تصمیم به مسافرت می\u200Cگیرد. او که همیشه رویای سفر داشت، برای اولین بار در زندگی خود پا به آمریکای شمالی گذاشت و پس از سفر در سراسر این مناطق، به سمت قاره\u200C اروپا حرکت کرد. کار در کشتی\u00AD\u200Cهای باری او را با بسیاری از نقاط مختلف دنیا آشنا کرد. کشورهای فرانسه تا اسپانیا و تنگه\u200C جبل الطارق را با دوچرخه پیمود و سپس به سمت کشورهای آفریقایی حرکت کرد. برایان در سال\u00AD\u200Cهای جوانی بیش از سن خود آموخت و با افراد زیادی آشنا شد. پروفسور آلبرت شوایتزر از بزرگانی بود که در سفر به آفریقای جنوبی با وی همسفر شد. در طول این سال\u00ADها برایان زندگی پرفرازو نشیبی داشت و حتی بارها از خطر مرگ نجات یافت. برایان جوان پس از دو سال زندگی در ژوهانسبورگ بازهم پا در مسیر پرهیجان سفر نهاد. او مدت کوتاهی در لندن مشغول به کار شد و راه خود را به سمت مناطق اروپا و خاورمیانه در پیش گرفت. پس از سفر به کشورهای هند، مالزی و سنگاپور به تایلند رسید و به مدت دوسال در این کشور کار کرد.\n" +
                        "\n" +
                        "\n" +
                        "                                                 برای تو کلید موفقیت این است که در زندگی\u200Cات عادتی بسازی \n" +
                        "                                                 از کارهایی که از انجامشان ترس داری.\n" +
                        "                                                  «برایان تریسی»\n"
            )


        )
        val adapterTopMan = AdaptorTopMan(dataTopMan, this)
        binding.recyclerHomeTopMan.adapter = adapterTopMan
        binding.recyclerHomeTopMan.layoutManager =
            LinearLayoutManager(context, RecyclerView.HORIZONTAL, false)
    }

    private fun runBook() {
        val dataBook = arrayListOf<DataBook>(

            DataBook(
                "https://s6.uupload.ir/files/کار-عمیق-رو-747x10241_6fpj.jpg",
                "کار عمیق",
                "کال نیوپورت", "" +
                        "کتاب کار عمیق یکی از تاثیرگذارترین کتاب\u200Cها در حوزه\u200Cی کسب و کار است که کال نیوپورت با هوشمندی کامل درباره\u200Cی عمیق شدن در یک کار و تفاوت آن با یک کار کم عمق صحبت می\u200Cکند.\n" +
                        "تاکنون اتفاق افتاده است که مشغول کار شوید ولی ناگهان متوجه شوید که اصلاً حواستان به کار نیست و دارید به مسائل دیگری فکر می\u200Cکنید؟ تاکنون پیش آمده که مشغول کار فکری شوید ولی نتوانید تمرکزتان را روی آن کار نگه دارید؟ کتاب کار عمیق به عنوان یکی از بهترین کتاب\u200Cها در زمینه موفقیت، کسب و کار و مدیریت تمرکز می\u200Cتواند به ما کمک کند که خیلی بهتر، مؤثرتر و سازنده\u200Cتر کار کنیم و با کار عمیق خود، نتایجی عالی به ارمغان بیاوریم.\n" +
                        "\n" +
                        "آقای نیوپورت در کتاب کار عمیق قواعدی برای کسب موفقیت در دنیای پرهرج و مرج، به ما آموزش می\u200Cدهد. وی در این کتاب می\u200Cگوید:\n" +
                        "کار عمیق، درسی است که من شخصاً در دوران کاریم بارها و بارها آن را یاد گرفتم. من ده سال است که از دنبال کنندگان سرسخت و جدی کار عمیق هستم اما هنوز هم زمان\u200Cهایی پیش می\u200Cآید که از قدرت آن غافلگیر می\u200Cشوم. در زمان دانشجویی\u200Cام که اولین بار با کار عمیق روبرو شدم و آن را اجرا کردم متوجه شدم که این کار عمیق مرا قادر کرده است تا دو مقاله معتبر و باکیفیت در سال بنویسم (این تعداد مقاله برای یک دانشجو واقعاً قابل احترام است) و در عین حال بر خلاف بسیاری از هم\u200Cدوره\u200Cهایم بیشتر از وقت اداری کار نکنم و در تعطیلات آخر هفته به ندرت به کار مشغول باشم."
            ),
            DataBook(
                "https://s6.uupload.ir/files/129074_13411_normal1_vil0.jpg",
                "باشگاه پنج صبح ها", "رابین شارما",
                "کتاب باشگاه پنج صبحی ها از آثار ارزشمند و پرفروش حوزه رشد و توسعه فردی است و تاکنون افراد زیادی آن را مطالعه کرده و از مطالب بی\u200Cنظیر آن بهره برده\u200Cاند. اساتید بهره\u200Cوری و رشد فردی بر این باور هستند که این کتاب بی\u200Cنظیر آقای رابین شارما این شایستگی را دارد که به عنوان یکی از کتاب\u200Cهای مرجع در دانشگاه\u200Cها تدریس شود.\n" +
                        "همان\u200C\u200Eگونه که از نام این کتاب انگیزشی مشخص است، مخاطب با خواندن آن با ارزش و اهمیت سحرخیزی آشنا می\u200Cشود و می\u200Cفهمد که بیدار شدن در ساعات ابتدایی صبح می\u200Cتواند قدرتی شگفت انگیز و معجزه\u200Cآسا برای او به ارمغان بیاورد.\n" +
                        "کتاب باشگاه پنج صبحی ها با یک روایت اصلی شروع می\u200Cشود که رابین شارما در حین روایت، درس\u200Cها و نکات مهم خودش را به مخاطب یادآوری می\u200Cکند. در داستان ما سه شخصیت اصلی ایفای نقش می\u200Cکنند که این سه شخصیت، یک کارآفرین افسرده و سرخورده، یک هنرمند درمانده و در جستجوی خلاقیت و یک میلیاردر بسیار موفق هستند. این سه نفر در یک سمینار بهینه\u200Cسازی فردی با یکدیگر آشنا می\u200Cشوند. در این سمینار اتفاقات جالبی رخ می\u200Cدهد و باعث می\u200Cشود که سر صحبت بین این سه نفر باز شود. این صحبت مقدمه را برای ارتباط بین این سه نفر فراهم می\u200Cکند و در نهایت میلیاردر موفق وقتی می\u200Cبیند که این دو نفر تشنه تغییر و موفقیت هستند، تصمیم می\u200Cگیرد که رمز موفقیت خودش را به آن\u200Cها بگوید.\n" +
                        "مسیری که داستان طی می\u200Cکند، بسیار جالب است. فرد موفق به هیچ عنوان رمز را کف دست آن\u200Cها نمی\u200Cگذارد. بلکه آن\u200Cها را چند روزی به جزیره خودش دعوت می\u200Cکند و به همراه آن\u200Cها سفری طولانی را در پیش می\u200Cگیرد. هر جای این سفر پر از نکته و رمز و راز است که با خواندن کتاب باشگاه 5 صبحی ها می\u200Cتوانید به این نکات ارزنده پی ببرید. یکی از جالب\u200Cترین جملاتی که در کتاب مطرح می\u200Cشود، این است که:\n" +
                        "بسیاری از افراد آرزو می\u200Cکنند که اتفاقات شگفت انگیزی برایشان رقم بخورد اما افراد موفق و برجسته یاد گرفته\u200Cاند که خوشان این اتفاقات را رقم بزنند.\n"
            ),
            DataBook(
                "https://s6.uupload.ir/files/78657_71114_normal_(1)1_acd5.jpg",
                "نیمه تاریک وجود",
                "دبی فورد",
                "برای قضاوت نشدن، پذیرفته شدن، محترم ماندن و در نهایت داشتن زندگی سالم و شاد باید درون خود را شناخت و با آن مواجه شد. بسیاری از انسان\u200Cها تلاش می\u200Cکنند تا احساسات منفی\u200Cشان را انکار و یا پنهان کنند تا در جامعه پذیرفته شوند. این احساسات همان سایه\u200Cها یا نیمه\u200Cی تاریک وجودمان هستند که همیشه برای روبرو شدن با آن\u200Cها مقاومت می\u200C\u200Cکنیم و از شناخت و تحلیل کردن\u200Cشان طفره می\u200Cرویم. کتاب نیمه\u200C تاریک وجود با ارائه\u200Cی روش\u200Cها و تمرین\u200Cهای موثر کمک می\u200Cکند تا از سایه\u200Cهای درونی خود که از چشم دیگران پنهان کرده\u200Cایم، آگاهی پیدا کنیم و برای رشد و ارتقای شخصیت خود تلاش کنیم. دبی فورد در کتاب نیمه تاریک وجود، با بیانی ساده و روان، روش\u200Cهای منظم و پیوسته\u200Cای که به یکپارچگی درونی کمک می\u200Cکنند را ارائه می\u200Cدهد. او با استفاده از تجربیات خود و دیگران شیوه\u200Cهای پذیرفتن ویژگی\u200Cهای انسانی را در ده فصل بیان می\u200Cکند."
            ),
            DataBook(
                "https://s6.uupload.ir/files/2927853316647762_0230.jpg",
                "قدرت شروع ناقص ",
                "جیمز کلیر",
                "آغاز می\u200Cکنید خودتان را با چه کسی مقایسه خواهید کرد؟ در دسترس\u200Cترین گزینه\u200Cها معمولا افراد موفق حوزه\u200Cای هستند که تصمیم داریم به آن وارد شویم، آدم\u200Cهایی که بعد از سال\u200Cها کوشش و خطا توانسته\u200Cاند راهکارهایی دقیق و تضمینی برای پیش بردن امور پیدا کنند. در این شرایط ما سعی می\u200Cکنیم به آن\u200Cها نگاه کنیم، خاطرات و تجربیاتشان را بخوانیم، پای حرف آن\u200Cها بنشینیم و قدم به قدم مسیرشان را تکرار کنیم. اما به نظر کلیر زمان شروع یک رشته یا حرفه، الگوگیری از عملکرد بهترین\u200Cهای آن حوزه کاری اشتباه است. البته یادگیری از تجربه دیگران عالی است و می\u200Cتواند به عنوان یک میانبر ما را از تجربه\u200Cهای تلخ یا روش\u200Cهای وقت\u200Cگیر نجات دهد، اما تقلید صد درصد از افراد موفق، گاهی به جای پیشروی، مانع حرکت ما می\u200Cشود. مقایسه وضعیت فعلی خود با فردی که سال\u200Cها از ما جلوتر است اغلب باعث می\u200Cشود احساس ناکافی بودن پیدا کنیم و با دیدن تجهیزات و توانایی\u200Cهای برتر دیگران، خیلی ساده دلسرد یا حتی از مسیر منحرف شویم، اما ابزار یا مهارتی که یک فرد را به بالاترین سطح کاری و حرفه\u200Cای می\u200Cرساند معمولا چیزی نیست که برای شروع از آن استفاده می\u200Cکند. جیمز کلیر در کتاب قدرت شروع ناقص سعی دارد به شما بگوید انرژی خود را در یافتن چیزی که واقعا به آن نیاز دارید صرف کنید. با پیروی از این الگو، متوجه می\u200Cشوید که جمع\u200Cآوری حریصانه و بی\u200Cمنطق ابزار، دوره\u200Cهای علمی و اطلاعات نه تنها کمک\u200Cکننده نیست، بلکه در بهترین حالت حرکتتان را کند می\u200Cکند. پس لیست طولانی نیازمندی\u200Cها را کوتاه کنید، افکار مزاحم را دور برانید و قبل از ظاهر شدن شک و تردیدهای بیشتر، اولین قدم به سمت قله را بردارید.\n"
            ),
            DataBook(
                "https://s6.uupload.ir/files/100052_64626_normal_82d8.jpg",
                "غول درون",
                "هری کارپنتر",
                "نحوه عملکرد و چگونگی استفاده از ضمیر ناخودآگاه به قلم هری کارپنتر، راهکارهایی را در اختیار شما قرار می\u200Cدهد تا به کمک آن بتوانید غول درون خود را کشف کرده و برای تغییر در روند زندگی آن را مطیع خود کنید.\n" +
                        "\n" +
                        "غول درون همان ضمیر ناخودآگاه شماست که بیشتر مواقع نمی\u200Cدانید چگونه کار می\u200Cکند و دقیقاً چطور باید از آن استفاده کرد. هدف هری کارپنتر از نگارش کتاب غول درون این است تا شما را با ضمیر ناخودآگاهتان آشنا کند. او راهنمای استفاده از ضمیر ناخودآگاه را جهت رسیدن به موفقیت، خوشبختی، سلامتی و آرامش ذهنی شما در این کتاب ارائه کرده است.\n" +
                        "\n" +
                        "اگر با چگونگی کارکرد ضمیر ناخودآگاهتان آشنایی داشته باشید گام بزرگی را در جهت رسیدن به موفقیت برداشته\u200Cاید. شیوه\u200Cها و روش\u200Cهای بکارگیری آن آسان است اما اگر از نحوه کارکرد ضمیر ناخودآگاه چیزی ندانید احتمال شکست خود را به میزان قابل توجهی افزایش خواهید داد. به عبارت دیگر می\u200Cتوان گفت کلید موفقیت آن است که به ضمیر ناخودآگاه خود از طریق یک حالت ذهنی تغییر یافته دسترسی داشته باشید.\n" +
                        "\n" +
                        "ضمیر خودآگاه انسان تنها 8٪ از ذهن را در بر می\u200Cگیرد، و مابقی متعلق به ضمیر ناخودآگاه است. ضمیر ناخودآگاه فاقد منطق بوده و تنها به ورود حسی استناد می\u200Cکند. لذا به حقایق و تصورات، به یک میزان واکنش نشان می\u200Cدهد. مثلا هنگامی که خواب پرت شدن از ساختمان را می\u200Cبینید، بدن شما واکنشی را نشان می\u200Cدهد که اگر در واقعیت این اتفاق بیفتد نشان می\u200Cدهد. بدنتان عرق کرده، ضربان قلب بالا می\u200Cرود و... پس این نکته بسیار مهم است. ضمیر ناخودآگاه تفاوت میان واقعیت و خیال را درک نمی\u200Cکند.\n" +
                        "\n" +
                        "کتاب غول درون تمرینات عملی بسیاری را نیز در اختیار شما قرار می\u200Cدهد و پس از هر درس دستورالعمل\u200Cهای ریلکسیشن ارائه می\u200Cکند که می\u200Cتوانید آن\u200Cها را دنبال کنید. جهت دستیابی به موفقیت نیاز است تا ضمیر ناخودآگاه خود را پرورش دهید و هری کارپنتر در این مسیر شما را یاری خواهد نمود.\n"
            ),
            DataBook(
                "https://s6.uupload.ir/files/frog11_6pd4.jpg",
                "قورباغه ات را قورت بده",
                "بریان تریسی",
                "کتاب قورباغه\u200Cات را قورت بده به شما نشان می\u200Cدهد چطور در حرفه\u200Cتان سریع\u200Cتر پیش بروید. این صفحات که در پیش رو دارید شامل بیست و یک اصل است که در مجموع قدرتمند\u200Cترین اصولی است که برایان تریسی (Brian Tracy) تا کنون در زمینه کارایی فردی کشف کرده است.\n" +
                        "هر ایده\u200Cای که در این کتاب عنوان می\u200Cشود روی بالا بردن سطح کلی بهره\u200Cوری، عملکرد و بازده کاری شما متمرکز شده است تا ارزش و اعتبار شما را در هر کاری که می\u200Cکنید بیشتر کند. شما می\u200Cتوانید بسیاری از این ایده\u200Cها را در زندگی خصوصی خود نیز به کار بگیرید.\n" +
                        "هر کدام از این روش\u200Cها و تکنیک\u200Cهای بیست و یک گانه به خودی خود کامل بوده و همگی ضروری هستند. روی هم رفته این ایده\u200Cهای بیست و یک گانه درمورد کارایی فردی مثل غذاهای متنوعی هستند که می\u200Cتوان آن\u200Cها را در هر زمان و به ترتیب اهمیتی که در شرایط کنونی برای شما دارد به طور دلخواه مورد استفاده قرار داد.\n" +
                        "کلید موفقیت عمل کردن است. این اصول برای بوجود آوردن سرعت و قابلیت پیش\u200Cبینی در عملکرد\u200Cها و نتایج به کار پرفته می\u200Cشوند. هرچقدر سریع\u200Cتر آن\u200Cها را یاد بگیرید و به کار ببندید مطمئنا در حرفه خود سریع\u200Cتر پیشرفت خواهید کرد."
            )

        )
        val adapterBook = AdaptorBook(dataBook, this)
        binding.recyclerHomeBook.adapter = adapterBook
        binding.recyclerHomeBook.layoutManager =
            LinearLayoutManager(context, RecyclerView.HORIZONTAL, false)
    }

    private fun runMusic() {
        val dataMusic = arrayListOf<DataMusic>(

            DataMusic(
                "https://s6.uupload.ir/files/پرنده_در_چنگل_k7et.jpeg",
                "موسیقی بیکلام به",
                "همراه صدای پرندگان",
                "https://dls.music-fa.com/tagdl/1402/Masoud%20Kiani%20-%20Yadete%20(320).mp3"
            ),
            DataMusic(
                "https://s6.uupload.ir/files/طلوع_خورشید_بین_درختان_79v3.jpg",
                "آهنگ طلوع خورشید ",
                "در بین درختان",
                "https://dls.music-fa.com/tagdl/1402/Babak%20Hosseini%20-%20Cheshm%20Rooshan%20(320).mp3"
            ),
            DataMusic(
                "https://s6.uupload.ir/files/تنها_با_طبیعت_incy.jpeg",
                "موسیقی بی کلام",
                "تنها با طبیعت",
                "https://dls.music-fa.com/tagdl/1402/Macan%20Band%20-%20Ghashang%20Ghashang%20(320).mp3"
            ),
            DataMusic(
                "https://s6.uupload.ir/files/آبشار_oajt.jpg",
                "موسیقی بیکلام به",
                "همراه صدای آبشار",
                "https://dls.music-fa.com/tagdl/1402/Tm%20Bax%20-%20Ragbari%20(320).mp3"
            ),
            DataMusic(
                "https://s6.uupload.ir/files/دریا_essq.jpg",
                "موسیقی بیکلام به",
                "همراه صدای دریا",
                "https://dls.music-fa.com/tagdl/1402/Fazel%20Deriss%20-%20Kam%20Nazashtam%20(320).mp3"
            ),
            DataMusic(
                "https://s6.uupload.ir/files/کلبه_rm1u.jpg",
                "موسیقی بیکلام",
                "در جنگل",
                "https://dls.music-fa.com/tagdl/1402/Ali%20Edein%20-%20Baghe%20Vahsh%20(320).mp3"
            )


        )
        val adapterMusic = AdaptorMusic(dataMusic, this)
        binding.recyclerHomeMusic.adapter = adapterMusic
        binding.recyclerHomeMusic.layoutManager =
            LinearLayoutManager(context, RecyclerView.HORIZONTAL, false)
    }

    private fun imageSlider() {
        val imageSlider = binding.imageSlider
        val imageList = ArrayList<SlideModel>()

        imageList.add(SlideModel("https://biaupload.com/do.php?imgf=org-328da02efac21.jpg"))
        imageList.add(SlideModel("https://biaupload.com/do.php?imgf=org-5fe7d0af997e2.jpg"))
        imageList.add(SlideModel("https://biaupload.com/do.php?imgf=org-1ad8ea4e3ae73.jpg"))
        imageList.add(SlideModel("https://biaupload.com/do.php?imgf=org-c1f8b6295b434.jpg"))
        imageList.add(SlideModel("https://biaupload.com/do.php?imgf=org-5d17c2a698041.jpg"))
        imageList.add(SlideModel("https://biaupload.com/do.php?imgf=org-d9dc68ac01cb2.jpg"))
        imageList.add(SlideModel("https://biaupload.com/do.php?imgf=org-f475986e00b73.jpg"))
        imageList.add(SlideModel("https://biaupload.com/do.php?imgf=org-12803534983c4.jpg"))



        imageSlider.setImageList(imageList, ScaleTypes.FIT)
        imageSlider.startSliding(2000)
    }


    override fun onItemClickedEducation(dataEducation: DataEducation) {

        val education_bundel = Bundle()
        education_bundel.putParcelable("dataEducation", dataEducation)
        findNavController().navigate(R.id.action_home_main_to_educationPage, education_bundel)


    }

    override fun onItemClickedTopMan(dataTopMan: DataTopMan) {
        val top_man_bundel = Bundle()
        top_man_bundel.putParcelable("dataTopMan", dataTopMan)
        findNavController().navigate(R.id.action_home_main_to_top_man_page, top_man_bundel)
    }

    override fun onItemClickedBook(dataBook: DataBook) {

        val book_bundel = Bundle()
        book_bundel.putParcelable("dataBook", dataBook)
        findNavController().navigate(R.id.action_home_main_to_book_page, book_bundel)
    }

    override fun onItemClickedMusic(dataMusic: DataMusic) {

        val bundel = Bundle()
        bundel.putParcelable("dataMusic", dataMusic)
        findNavController().navigate(R.id.action_home_main_to_music_page, bundel)

    }




}