package com.example.nemomind.fragmentsAll

import android.os.Bundle
import androidx.fragment.app.Fragment
import android.view.LayoutInflater
import android.view.View
import android.view.ViewGroup
import androidx.navigation.fragment.findNavController
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView
import com.example.nemomind.R
import com.example.nemomind.adaptors.AdaptorEducation
import com.example.nemomind.adaptors.AdaptorTopMan
import com.example.nemomind.databinding.FragmentEducationShowMoreBinding
import com.example.nemomind.databinding.FragmentTopManShowMoreBinding
import com.example.nemomind.datas.DataEducation
import com.example.nemomind.datas.DataTopMan


class top_man_show_more : Fragment() ,AdaptorTopMan.ItemEventsTopMan {


    lateinit var binding: FragmentTopManShowMoreBinding


    override fun onCreateView(
        inflater: LayoutInflater,
        container: ViewGroup?,
        savedInstanceState: Bundle?
    ): View? {

        binding = FragmentTopManShowMoreBinding.inflate(layoutInflater)
        return binding.root

    }

    override fun onViewCreated(view: View, savedInstanceState: Bundle?) {
        runTopMan()

    }
    private fun runTopMan() {
        val dataTopMan = arrayListOf<DataTopMan>(
            DataTopMan(
                "https://s6.uupload.ir/files/pic_4_1_as69.jpg",
                "دکتر محمود حسابی",
                "پدر علم فیزیک",
                "محمود حسابی (زاده ۳ اسفند ۱۲۸۱ در تهران – درگذشت ۱۲ شهریور ۱۳۷۱ در ژنو) با نام اصلی محمود خان میرزا حسابی یک فیزیکدان و، سناتور هسته ای ایران بود، دکتر حسابی وزیر آموزش و پرورش ایران در کابینه نخست وزیر محمد مصدق بود وی در زمان سلطنت پهلوی و بنیان\u200Cگذار فیزیک و مهندسی دانشگاهی در ایران بود.\n" +
                        " \n" +
                        "حسابی در تهران در خانواده عباس و گوهرشاد حسابی متولد شد. زادگاه خانواده وی تفرش ، در استان مرکزی ، ایران است. در سن چهار سالگی ، خانواده وی به بیروت نقل مکان کردند و در آنجا حسابی در دبستان تحصیل کرد. او هنوز در دوران دبیرستان بود که جنگ جهانی اول شروع شد و مدارس فرانسوی زبان تعطیل شدند. حسابی تحصیلات خود را 2 سال در خانه ادامه داد و در سال 1922، وی مدرک مهندسی راه را از دانشگاه آمریکایی بیروت به دست آورد.\n" +
                        " \n" +
                        "در سن هفده سالگی لیسانس ادبیات، و در سن نوزده سالگی لیسانس بیولوژی را اخذ نمود. پس از آن در رشته مهندسی راه و ساختمان از دانشکده فرانسوی مهندسی در بیروت فارغ التحصیل شد. در آن دوران با اشتغال در نقشه کشی و راهسازی، به امرار معاش خانواده کمک می\u200Cکرد. او همچنین در رشته\u200Cهای پزشکی، ریاضیات و ستاره شناسی به تحصیلات دانشگاهی پرداخت. پس از مدت كوتاهی كار برای وزارت راه بیروت پیدا کرد.\n" +
                        " \n" +
                        "شرکت راهسازی فرانسوی که او در آن مشغول به کار بود، به پاس قدردانی از زحماتش، وی را برای ادامه تحصیل به فرانسه اعزام کرد. در سال ۱۹۲۴ میلادی به مدرسه عالی برق پاریس راه یافت و در سال ۱۹۲۵ میلادی فارغ التحصیل شد.\n" +
                        " \n" +
                        "حسابی برای تحصیلات بیشتر به پاریس سفر كرد ، وی در رشته مهندسی برق در و بعداً درجه دكترا در سال 1927 به وی اعطا شد.\n" +
                        " \n" +
                        "در تهران ، حسابی وابسته به دانشگاه تهران بود و دانشکده های علوم و مهندسی دانشگاه را مدیریت می کرد، او در زمان تحصیل در دانشگاه ، معلم النوش تریان بود . در ژوئن سال 1951 ، حسابی در یک هیئت استانی سه نفره شرکت نفت ایران شرکت کرد و به جانشین تعیین شده شرکت نفت انگلیس-ایران منصوب شد. در دسامبر سال 1951 ، وی به عنوان وزیر آموزش و پرورش جایگزین کریم سنجابی شد. بین سال های 1961 و 1969 ، حسابی نماینده ایران در کمیته علمی و فنی ، کمیته سازمان ملل در استفاده صلح آمیز از فضای بیرونی بود.\n" +
                        " \n" +
                        "طی سال\u200Cها تحقیق و مطالعات علمی در دانشگاههای معتبر عالم با دانشمندان بزرگ جهان نظیر پرفسور \"انیشتین\"، \"شرودینگر\"، \"بورن\"، \"فرمی\" و چندین فیزیکدان دیگر و همچنین علمای بزرگ مانند \"راسل\" و \"آندره ژید\" همکاری و تبادل نظر داشته و تنها ایرانی شاگرد پروفسور \"آلبرت اینشتین\" بود.\n" +
                        "\n" +
                        "\n" +
                        "                                    همیشه هر چیزی را که دوست داریم به دست نمی آوریم، \n" +
                        "                                    پس بیاییم آنچه را که به دست می آوریم دوست بداریم .  \n" +
                        "                                   «دکتر محمود حسابی»\n"
            ),
            DataTopMan(
                "https://s6.uupload.ir/files/biography-alberteinstein-3203_bnap.jpg",
                "آلبرت انیشتین",
                "فیزیکدان",
                "آلبرت اَینشتَین  (۱۴ مارس ۱۸۷۹ – ۱۸ آوریل ۱۹۵۵) فیزیک\u200Cدان نظری زادۀ آلمان بود. آلبرت انیشتین بسیار به نوازندگی علاقه مند بود و یادگیری ویولون را از ۵ سالگی آغاز کرد، و این نابغه ی جوان علاقه ی زیادی به این ساز پیدا کرده بود و در سال های جوانی تا باقی عمرش به نواختن آن ادامه داد.اینشتین هم به کسب و کار خانوادگیشان ملحق شد اما با ورشکستگی آن ها مجبور شدند به شمال ایتالیا جا به جا شوند و در آنجا بود که انیشتین نوجوان مقاله ای نوشت که اکنون به عنوان اولین مقاله ی علمی او شناخته می شود. این مقاله به بررسی ماهیت اتر می پرداخت، و این فرضیه  براساس توصیف چگونگی حرکت نور در فضا بود و انیشتین بعدها آن را رد کرد. و جالب است بدانید آلبرت انیشتین تا پایان عمر خود بیش از 300 مقاله ی علمی منتشر کرد.\n" +
                        "انیشتین در سال 1900 با کسب مدرک تدریس فیزیک از دانشگاه پلی تکنیک زوریخ در سوئیس فارغ التحصیل شد. او در دروس فیزیک نظری، استعداد قابل توجهی داشت اما نمرات ریاضی اش در آن حد خوب نبود. بعدها که سنش بیشتر شد در مورد این موضوع گفت: برای من دانشجو مشخص نبود که دانش پیچیده ی قواعد بنیادین فیزیک، تا این حد با متدهای پیچیده ریاضیات گره خورده است.انیشتن زمانی که به دلیل تحصیل در دانشگاه پلی تکنیک در زوریخ سوئیس به سر می برد با میلوا آشنا شده بود که هم دوره ای فیزیک او بود اما هیچ گاه درسش را به پایان نرساند. آن ها در سال 1903 با هم ازدواج کردند. اولین پسر آن ها هانس آلبرت اینشتین نام داشت.اما او حتی با وجود مدرک تدریس فیزیک هم نتوانست در دانشگاهی شروع به تدریس کند و از تلاش برای ادامه تحصیل در مقطع دکترا دست کشید. اما گرفتن مدرک دکترا می توانست در پیدا کردن شغل مناسب به او کمک کند اما آلبرت در عوض سال 1903 به عنوان کارمند اداره ی ثبت مالکیت معنوی اختراعات در برن آلمان مشغول به کار شد. دو سال بعد بود که نظریه ی نسبیت خاص خود را منتشر کرد.\n" +
                        "\n" +
                        "\n" +
                        "                                            از دیروز یاد بگیرید\n" +
                        "                                           برای امروز زندگی کنید           \n" +
                        "                                           به فردا امیدوار باشید\n" +
                        "                                           «آلبرت انیشتین»    "
            ),
            DataTopMan(
                "https://s6.uupload.ir/files/بیوگرافی-پروفسور-سمیعی_v1rw.jpg",
                "پرفسور مجید سمیعی",
                "جراح مغز و اعصاب",
                "پروفسور مجید سمیعی درتاریخ  29 خرداد 1316 در شهر تهران و در خانواده ای فرهیخته چشم به جهان گشودند.ایشان پس از اتمام تحصیلات دوره دبیرستان در ایران راهی کشور آلمان شدند و در دانشگاه ماینتز در رشته پزشکی مشغول به ادامه تحصیل گردیدند. نظر به موفقیتهای علمی ایشان در دوران تحصیلات پزشکی و کسب عالیترین نمرات ممکن در امتحانات پایان دوره پزشکی، جایزه ویژه وزارت علوم ایران برای برترین دانشجویان ایرانی مقیم اروپا به ایشان تعلق گرفت. پس از فراغت از تحصیل در رشته پزشکی و همچنین اتمام تحصیلات ثانوی در بیولوژی، ایشان تحصیلات تخصصی خود در رشته جراحی مغز و اعصاب را در دانشگاه ماینتزآغازنمودند و در سال 1970 موفق به دریافت مدرک بورد تخصصی این رشته از کشور آلمان شدند.\n" +
                        "در آوریل 1970 و تنها در سن 32 سالگی ایشان موفق به دریافت عنوان دانشیاری در رشته جراحی مغز و اعصاب گردیدند و فعالیت خویش را بعنوان معاون دپارتمان جراحی مغز و اعصاب دانشگاه ماینتز ادامه دادند. یکسال بعد و در سال 1971 ایشان موفق به دریافت عنوان استادی (پروفسور) در رشته جراحی مغز و اعصاب گردیدند. در این سال پیشنهاد عنوان استادی و ریاست دپارتمان رشته جراحی مغز و اعصاب دردانشگاه ملی ایران (دانشگاه شهید بهشتی کنونی) به ایشان داده شد. لیکن ایشان جهت ادامه فعالیت علمی خود در دانشگاه ماینتز از پذیرش این سمت مهم امتناع نمودند. در سال 1977 ایشان ریاست دپارتمان جراحی مغز و اعصاب در بیمارستان نورداشتات در هانوفر آلمان را پذیرفتند، سمتی که ایشان تا سال 2003 عهده دار آن بودند.\n" +
                        " از سال 1996 ایشان ریاست هر دو دپارتمان جراحی مغز و اعصاب در بیمارستان نورداشتات و دانشگاه پزشکی هانوفر را عهده دار شدند. در سال 2000 پروفسور سمیعی موسسه بین المللی علوم اعصاب را در هانوفر بنیان نهادند و ریاست آنرا برعهده گرفتند. در سال 2003 ایشان بازنشستگی خود از ریاست دپارتمانهای جراحی مغز اعصاب در بیمارستان نورد اشتات و دانشگاه پزشکی هانوفر را اعلام نموده و خود را وقف توسعه موسسه بین المللی علوم اعصاب نمودند. در سال 2004 پروفسور سمیعی همچنین ریاست موسسه بین المللی علوم اعصاب چین واقع در دانشگاه پزشکی پایتخت (Capital Medical University) در پکن را نیز تقبل نمودند. در سال 2010  ساخت موسسه بین المللی علوم اعصاب ایران در تهران برنامه ریزی و عملیات ساختمانی آن آغاز گردید. پروفسور مجید سمیعی بیانگذار و رئیس موسسه بین المللی علوم اعصاب ایران میباشند که در آینده نزدیک راه اندازی خواهد شد.\n" +
                        "پروفسور مجید سمیعی  همچنین در سال 1979 نخستین دوره آموزشی جراحی قاعده جمجمه در جهان را در هانوفر پایه گذاری نمودند. علاوه بر دوره های منظمی که ایشان در آلمان برگزار می نمودند، دوره های آموزشی مشابه دیگری نیز درسایر کشورها در سراسر جهان جهت ارتقای دانش جراحان مغز و اعصاب توسط ایشان پایه گذاری و برگزار گردید.\n" +
                        " در سال 2004 سازمان تامین اجتماعی ایران ریاست دپارتمان جراحی مغز و اعصاب بیمارستان میلاد تهران را به پروفسور مجید سمیعی پیشنهاد نمودند.ازآن پس وبه رهبری ایشان، دوره های آموزشی منسجم و جامعی برای کارکنان دپارتمان برنامه ریزی و اجرا گردید که نتیجه آن تبدیل این دپارتمان به یکی از توسعه یافته ترین و پیشرفته ترین مراکز جراحی مغز واعصاب بوده است. از سال 2006 پروفسور سمیعی سمپوزیوم بین المللی جراحی مغز و اعصاب را بطور مستمردر تهران و به رهبری خود بنیاد نهادند.\n" +
                        "\n" +
                        "\n" +
                        "                                              اگر عقل امروزمو داشتم        \n" +
                        "                                             هیچ وقت اشتباهات دیروزمو نمی کردم\n" +
                        "                                             ولی اگر اشتباهات دیروزمو نمی کردم\n" +
                        "                                             عقل امروزمو نداشتم \n" +
                        "                                             پس باید از اشتباهات نهایت استفاده رو کرد. \n" +
                        "\n" +
                        "                                                                         «پروفسور سمیعی» \n"
            ),
            DataTopMan(
                "https://s6.uupload.ir/files/ifgkx715roof1_gfk1.jpeg",
                "بیل گیتس",
                "موسس ماکروسافت",
                "ویلیام هنری گیتس متولد 28 اکتبر 1955 در سیاتل می باشد . او برنامه نویس، کارآفرین، بازرگان، سرمایه\u200Cدار، نیکوکار و مدیر ارشد اجرایی آمریکایی است که در سال ۱۹۷۵ با مشارکت پل آلن شرکت مایکروسافت را بنیان گذاشت. وی تا دسامبر ۲۰۲۲ با تخمین دارایی خالص ۱۰۷ میلیارد دلار به\u200Cعنوان پنجمین فرد ثروتمند جهان شناخته شد.\n" +
                        " گیتس در خانواده\u200Cای به دنیا آمد که در تجارت و سیاست و خدمات اجتماعی سرشناس بودند. پدر وی ویلیام هنری گیتس دوم وکیل دادگستری و یکی از سرشناسان شهر سیاتل، واشینگتن بود و مادر او آموزگار مدرسه و یکی از اعضای هیئت مدیره یونایتد اینترنشنال بود که در امور خیریه نیز فعالیت داشت. بر خلاف سایرین، او به برنامه\u200Cنویسی با زبان BASIC علاقۀ زیادی داشت. گیتس در مدرسۀ لیکساید در سیاتل تحصیل کرد و چنان شیفتۀ برنامه\u200Cنویسی کامپیوتر بود که برخی برنامه\u200Cها را خراب می\u200Cکرد تا زمان بیشتری را با کامپیوتر بگذراند. بارها استفاده از کامپیوتر را برای او قدغن کردند\n" +
                        "\n" +
                        "بیل گیتس بارها در مصاحبه های خود گفته است که اگر بخواهید راز موفقیت را به ۶ مورد تقسیم کنید اولین مورد پاکسازی افکار منفی و دوری از هرگونه منفی بافی است. اما بنظرتان چطور میتوان به این مهم دست یافت. محققین حوزه موفقیت روش های زیادی را برای پاکسازی افکار منفی عنوان کردن که پرتکرار ترین آنها دوری از افراد منفی باف است. اما اکنون میخواهم تکنیکی را به شما بگویم که تا کنون در هیچ جای دیگر مطرح نشده است و آن تکنیک آشتی با کودک درون در حالت آلفای ذهنی است. حالت آلفای ذهنی وضعیتی است که فرکانس ذهن شما تا ۷ هرتز پایین آمده و نیم کره راست مغزتان فعال شده و وارد ضمیرناخودآگاهتان میشوید. در این حالت هر جمله ای را که تکرار کنید به باورتان تبدیل میشود پس کافیست وارد حالت آلفا شده و جملاتی برعکس آنچه که در موردش منفی بافی میکردید را به زبان بیاورید.(یعنی بر عکس آن جمله منفی که همیشه میگفتید را بگویید)\n" +
                        "\n" +
                        "\n" +
                        " \n" +
                        "                                                به نظر من عشق و علاقه زياد به تداوم در امر يادگيري \n" +
                        "                                                 .عامل بسيار مهمي است \n" +
                        "                                                 من در دوران كودكي آموختم كه \n" +
                        "                                                 زياد كتاب بخوانم.         \n" +
                        "                                               «بیل گیتس»  \n"
            ),
            DataTopMan(
                "https://s6.uupload.ir/files/photo4362259317_kgwb.jpg",
                "هلن کلر",
                "نویسنده",
                "هلن آدامز کلر نمونه\u200Cای قدرتمند از فردی نابینا و ناشنوا بود که در طول زندگی چشمگیر خود توسط عزم، سخت\u200Cکوشی و تخیلش توانست بر سختی\u200Cها پیروز شود. او با غلبه بر شرایط سخت و با پشتکار فراوان، به یک نویسنده، فعال حقوق بشر و فردی مشهور و جهانی تبدیل شد.\n" +
                        "کلر شخصیتی ماندگار را به تصویر می\u200Cکشد که با اراده\u200Cای منحصربه\u200Cفردش و على\u200Cرغم محروم\u200Cبودن از نعمت\u200Cهای بینایی، شنوایی و گویایی توانست به بهترین وجه با محیط اطراف خود فعالانه ارتباط برقرار سازد و حتی به درجات بالای علمی دست یابد.\n" +
                        "در پایتخت ایالات متحده، یک مجسمه برنزی از کلر هفت ساله در کنار پمپ آب وجود دارد که با الهام از تصویری از نقطه عطف واقعی در زندگی او ساخته شده\u200Cاست.\n" +
                        "هلن در ۲۷ ژوئن ۱۸۸۰ در شهر توسکومبیا در شمال غربی آلاباما به\u200Cدنیا آمد. پدر او، آرتور کلر، کاپیتان بازنشسته ارتش و سردبیر روزنامه\u200Cای محلی به\u200Cنام آلابامای شمالی بود و مادرش، کیت کلر، زنی جوان و تحصیل\u200Cکرده بود. کلر اولین دختر آرتور از کیت بود و او دارای دو برادر ناتنی دیگر نیز بود.\n" +
                        "کلر با حواس بینایی و شنوایی به\u200Cدنیا آمد و به\u200Cقدری باهوش بود که از شش ماهگی شروع به صحبت و از یک سالگی شروع به راه رفتن کرد. او هنگامی که ۱۹ ماهه بود به بیماری مبتلا شد که پزشک خانواده آن را تب مغزی نامید. ماهیت واقعی این بیماری هنوز یک راز است و برخی کارشناسان معتقدند که این بیماری ممکن است مخملک یا مننژیت باشد.\n" +
                        "چند روز پس از شروع تب، مادر کلر متوجه شد که دخترش نسبت به حرکات و صداها واکنشی نشان نمی\u200Cدهد. او حواس بینایی و شنوایی خود را از دست داده\u200Cبود.\n" +
                        "\n" +
                        "کودکی هلن کلر:\n" +
                        "هلن فوق\u200Cالعاده باهوش بود و سعی می\u200Cکرد از طریق لمس، بوییدن\u200C و چشیدن\u200C محیط اطرافش را درک کند. او روش محدودی برای ارتباط با همراهانش داشت و توسط زبان اشاره می\u200Cتوانست علامت\u200Cهایی را برای برقراری ارتباط اختراع کند.\n" +
                        "پرتره هلن کلر به عنوان یک دختر جوان، با یک سگ سفید بر روی پایش (اوت ۱۸۸۷)\n" +
                        "با این\u200Cحال در این مدت متوجه شده\u200Cبود که افراد دیگر خانواده به روش دیگری باهم ارتباط برقرار می\u200Cکنند و هنگامی که متوجه حرکت لب\u200Cهای آنها می\u200Cشد احساس خشم می\u200Cکرد.\n" +
                        "او در این مدت بسیار وحشی و سرکش شده\u200Cبود و هنگام عصبانیت شروع به لگد زدن\u200C\u200C و جیغ کشیدن\u200C می\u200Cکرد. برخی افراد خانواده معتقد بودند که او باید در پرورشگاه بزرگ شود.\n" +
                        "کلر بعداً در زندگی\u200Cنامه خود نوشت:\n" +
                        "«نیاز به ارتباط برخی مواقع آنقدر ضروری می\u200Cشد که این سرکشی\u200Cها روزانه و گاهی هر چند ساعت اتفاق می\u200Cافتادند.»\n" +
                        "با وجود اینکه او فشار زیادی را به پدر و مادرش وارد می\u200Cکرد، مادر هلن همچنان امیدوار بود و سخت\u200Cکوشانه دنبال راهی برای تربیت او می\u200Cگشت.\n" +
                        "هلن اولین نوشته خود را هفت روز قبل از اتمام هفت سالگی\u200Cاش کامل کرد. او سریع به تسلط بر حروف الفبای دستی و دستگاه چاپ برجسته خوانندگان نابینا ادامه داد و در خواندن و نوشتن مهارت پیدا کرد. با وجود اینکه در دست\u200Cخط هلن بسیاری از حروف گرد مربعی به\u200Cنظر می\u200Cرسید، از خوانایی خوبی برخوردار بود.\n" +
                        "اولین نامه هلن کلر\n" +
                        "\n" +
                        "در ماه مه سال ۱۸۸۸، سالیوان کلر را به مدرسه نابینایان پرکینز، در بوستون برد. جایی که دنیای جدیدی از دوستی\u200Cهای هلن آغاز شد. او توانست با کودکان نابینا ارتباط برقرار کند و به بازی آنها بپیوندد. او درباره این دیدار نوشت:\n" +
                        "\n" +
                        "    «آه، چه خوشبختی! برای صحبت آزادانه با بچه\u200Cهای دیگر، برای اینکه در این دنیای بزرگ احساس کنید که به جایی تعلق دارید.»\n" +
                        "\n" +
                        "پس از آن دیدار کلر تقریبا هر زمستان را به تحصیل در پرکینز می\u200Cگذراند. او زبان فرانسه، حساب، جغرافیا و موضوعات دیگر را مطالعه کرد. کتابخانه کتاب\u200Cهای برجسته و پرندگان و حیوانات موزه لمسی از جمله مکان\u200Cهای ویژه\u200Cای بود که موردعلاقه هلن قرار گرفت.\n" +
                        "\n" +
                        "هلن در سال ۱۸۹۰ و زمانی که ده ساله بود، ابراز تمایل کرد که صحبت کردن را بیاموزد. سالیوان وی را به دیدن سارا فولر در مدرسه ناشنوایان بوستون برد و فولر برای ۱۱ جلسه به او آموزش داد. پس از آن، سالیوان خودش به هلن آموزش می\u200Cداد. بااین\u200Cحال هلن در طول زندگی\u200Cاش از صدای گفتاری خود که درک آن سخت بود ناراضی بود.\n" +
                        "کلر در مورد روزهای بعدی که با سالیوان داشت نوشت:\n" +
                        "    «من کاری انجام ندادم جز اینکه با دستانم کاوش کردم و نام هر شیئی را که لمس می\u200Cکردم را یاد گرفتم. و هر چه بیشتر با چیزها کار می\u200Cکردم و نام و کاربرد آنها را یاد می\u200Cگرفتم، احساس شادی بیشتری به جهان پیدا می\u200Cکردم و اعتماد به\u200Cنفسم بیشتر می\u200Cشد.»</"
            ),
            DataTopMan(
                "https://s6.uupload.ir/files/seb0xfugja9wqpoq-1_(1)_nfrn.jpg",
                "بریان تریسی",
                "نویسنده و کارآفرین",
                "برایان تریسی زاده شارلوت تاون در جزیره\u200C پرنس ادوارد کانادا، سال ۱۹۴۴ میلادی است. وی در خانواده\u200Cای با ناتوانی\u200Cهای مالی به دنیا آمد. با وجود این، خانواده\u200C تریسی انسان\u200Cهایی اخلاق مدار و درستکار بودند.  شنیدن مداوم جملاتی همچون “پول نداریم” و “ما نمی\u200Cتوانیم هزینه\u200C آن را بپردازیم”  برایان کوچک را در این فکر فرو می\u200Cبرد که چرا کیفیت زندگی پایین\u200Cتری نسبت به دیگران دارند. در نهایت، این ابهامات، دغدغه\u200Cها و نیازهای زندگی او را ناچار به ترک تحصیل در دوران دبیرستان نمود. او در این مرحله از زندگی برای کسب درآمد به کارهای مختلفی مشغول شد. شستن ظروف و نظافت در هتل\u200Cها و رستوران\u200Cها، کار در کارخانه\u200C چوب\u200Cبری و کار فصلی در مزارع از جمله مشاغل طاقت\u200Cفرسایی بود که برایان به آن\u200Cها روی آورده بود.\n" +
                        "در اوایل جوانی، برایان ۲۰ ساله که به قدر کافی زندگی نکرده بود، دل به دریا می\u200Cزند و با پس\u200Cاندازی که از کارهای روزانه جمع کرده بود، تصمیم به مسافرت می\u200Cگیرد. او که همیشه رویای سفر داشت، برای اولین بار در زندگی خود پا به آمریکای شمالی گذاشت و پس از سفر در سراسر این مناطق، به سمت قاره\u200C اروپا حرکت کرد. کار در کشتی\u00AD\u200Cهای باری او را با بسیاری از نقاط مختلف دنیا آشنا کرد. کشورهای فرانسه تا اسپانیا و تنگه\u200C جبل الطارق را با دوچرخه پیمود و سپس به سمت کشورهای آفریقایی حرکت کرد. برایان در سال\u00AD\u200Cهای جوانی بیش از سن خود آموخت و با افراد زیادی آشنا شد. پروفسور آلبرت شوایتزر از بزرگانی بود که در سفر به آفریقای جنوبی با وی همسفر شد. در طول این سال\u00ADها برایان زندگی پرفرازو نشیبی داشت و حتی بارها از خطر مرگ نجات یافت. برایان جوان پس از دو سال زندگی در ژوهانسبورگ بازهم پا در مسیر پرهیجان سفر نهاد. او مدت کوتاهی در لندن مشغول به کار شد و راه خود را به سمت مناطق اروپا و خاورمیانه در پیش گرفت. پس از سفر به کشورهای هند، مالزی و سنگاپور به تایلند رسید و به مدت دوسال در این کشور کار کرد.\n" +
                        "\n" +
                        "\n" +
                        "                                                 برای تو کلید موفقیت این است که در زندگی\u200Cات عادتی بسازی \n" +
                        "                                                 از کارهایی که از انجامشان ترس داری.\n" +
                        "                                                  «برایان تریسی»\n"
            )


        )
        val adapterTopMan = AdaptorTopMan(dataTopMan, this)
        binding.recyclerShowMoreTopMan.adapter = adapterTopMan
        binding.recyclerShowMoreTopMan.layoutManager =
            LinearLayoutManager(context, RecyclerView.VERTICAL, false)
    }
    override fun onItemClickedTopMan(dataTopMan: DataTopMan) {
        val top_man_bundel = Bundle()
        top_man_bundel.putParcelable("dataTopMan", dataTopMan)
        findNavController().navigate(R.id.action_top_man_show_more_to_top_man_page, top_man_bundel)
    }





}